[
  {
    "name": "Ginger-Scallion Steamed Fish",
    "url": "https://cooking.nytimes.com/recipes/1024123-ginger-scallion-steamed-fish",
    "image": "https://static01.nyt.com/images/2023/04/20/multimedia/as-ginger-scallion-fish-fgqk/as-ginger-scallion-fish-fgqk-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "1½ pounds firm fish, such as salmon, halibut or haddock, cut into 1-inch cubes and patted dry",
      "1 tablespoon Diamond Crystal Kosher salt or 1 ½ teaspoons fine sea salt",
      "4 scallions",
      "1 (1-inch) piece fresh ginger",
      "2 tablespoons soy sauce",
      "1 tablespoon granulated sugar, plus more as needed"
    ],
    "full_instructions": [
      "In a medium bowl, stir together 1 cup water with the fish and salt. Set aside for 10 minutes. (This quick brine will help the fish stay tender.)",
      "Meanwhile, slice the scallion whites and light green parts into 1-inch-thick segments, then thinly slice the greens for garnish. Peel the ginger and cut into thin matchsticks.",
      "In a large pot or skillet with a lid, combine ½ cup water with the scallion segments, ginger, soy sauce and sugar. Bring to a simmer over medium-high and cook until reduced by about half, 5 to 7 minutes.",
      "Reduce heat to low, then use a slotted spoon or your fingers to transfer the fish to the pot. (No need to pat it dry first.) Stir to coat in the soy mixture, then shake into an even layer. Cover and cook until the fish is cooked through, 8 to 12 minutes.",
      "Taste the sauce in the pot and if it’s too salty, stir in a pinch of sugar. Divide the fish among bowls, including the sauce, ginger and scallions, and top with the thinly sliced scallion greens. It’s good warm, at room temperature (you can leave out up to 2 hours), or cold from the fridge (store it for up to 1 day)."
    ]
  },
  {
    "name": "Roasted Honey Nut Squash and Chickpeas With Hot Honey",
    "url": "https://cooking.nytimes.com/recipes/1023687-roasted-honey-nut-squash-and-chickpeas-with-hot-honey",
    "image": "https://static01.nyt.com/images/2022/01/28/multimedia/28apperex-1-9164/28apperex-1-9164-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "2 (14.5-ounce) cans chickpeas (preferably not “no salt added”), drained and rinsed",
      "2½ pounds honey nut or butternut squash, peeled, trimmed, seeded and cut into 1-inch cubes (6 cups)",
      "1¾ teaspoons baharat, garam masala or another spice blend",
      "1¼ teaspoons fine salt, plus more as needed",
      "5 thyme sprigs",
      "⅛ teaspoon red-pepper flakes",
      "3 tablespoons extra-virgin olive oil, plus more as needed",
      "1 small red onion, thinly sliced",
      "1 teaspoon cider vinegar or rice wine vinegar, plus more as needed",
      "½ cup fresh cilantro leaves or dill sprigs, or a combination",
      "1 to 2 tablespoons hot honey, plus more to taste",
      "Plain whole-milk yogurt or sour cream, for serving (optional)"
    ],
    "full_instructions": [
      "Heat oven to 425 degrees. Line one sheet pan with parchment paper and a second sheet pan with a clean kitchen towel or paper towels. Place drained chickpeas on the towel-lined sheet pan and gently rub them dry. Place the pan on the back of the stove and let the chickpeas dry as you prepare the other ingredients.",
      "Place the squash on the parchment paper-lined pan and toss with 1 teaspoon baharat, ½ teaspoon salt, thyme sprigs, red-pepper flakes and 2 tablespoons oil. Spread squash into an even layer and roast for 20 minutes.",
      "After 20 minutes of roasting, in a medium bowl, combine chickpeas, red onion, remaining ¾ teaspoon baharat, ¾ teaspoon salt and 1 tablespoon oil, and toss until well combined. Add the mixture to the pan of squash and stir everything well. Continue roasting for another 30 minutes, tossing the mixture halfway through, until the squash is golden brown and tender, and the chickpeas and onions are slightly crispy.",
      "Remove the pan from the oven, sprinkle vinegar and herbs on top and toss. Drizzle with hot honey and toss again to combine. Taste and season with more salt, more hot honey and vinegar to taste. Serve with dollops of yogurt if you’d like."
    ]
  },
  {
    "name": "Vegetable Tortilla Soup",
    "url": "https://cooking.nytimes.com/recipes/1024047-vegetable-tortilla-soup",
    "image": "https://static01.nyt.com/images/2023/05/05/multimedia/hew-vegetable-tortilla-soup-wgvp/hew-vegetable-tortilla-soup-wgvp-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "3 tablespoons neutral oil, like grapeseed",
      "1 small purple cabbage, halved, cored and finely shredded",
      "Kosher salt and black pepper",
      "1 large sweet potato, peeled and cut into ½-inch cubes",
      "1 medium yellow onion, finely chopped",
      "6 garlic cloves, finely chopped",
      "½ packed cup tortilla chips, finely ground in a spice grinder or blender",
      "2 cups tomato purée",
      "3 canned chipotles in adobo, finely chopped",
      "1 (15-ounce) can pinto beans, drained",
      "Lightly crushed tortilla chips, diced avocado, vegan sour cream or yogurt, chopped cilantro and yellow onion, lime wedges"
    ],
    "full_instructions": [
      "Heat the oil in a large, heavy-bottomed pot over high. Add the cabbage, season with a large pinch of salt and cook, occasionally stirring, until softened, lightly charred in spots and smelling smoky, about 10 minutes. Add the sweet potato, onion, garlic and another pinch of salt and cook, stirring frequently, until the onion and garlic have softened, about 5 minutes.",
      "Stir in the tortilla chips. Add the tomato purée and chipotles and bring to a simmer.",
      "Add 5 cups of water and another large pinch of salt; bring to a boil. Reduce the heat to maintain a simmer and cook, stirring occasionally, until the soup is thickened and the sweet potatoes are cooked through, about 15 minutes.",
      "Stir in the pinto beans; season to taste with salt and pepper.",
      "Divide soup among bowls and serve with desired toppings."
    ]
  },
  {
    "name": "White Beans and Asparagus With Charred Lemon",
    "url": "https://cooking.nytimes.com/recipes/1024204-white-beans-and-asparagus-with-charred-lemon",
    "image": "https://static01.nyt.com/images/2023/05/16/multimedia/-as-charred-lemon-white-beans-fblz/-as-charred-lemon-white-beans-fblz-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "3 tablespoons extra-virgin olive oil or coconut oil",
      "1 large or 2 small lemons, quartered lengthwise and seeds removed",
      "1 (14-ounce) can full-fat coconut milk",
      "3 cups cooked, rinsed white beans (homemade or two 15-ounce cans)",
      "1 bunch asparagus (about 1 pound), tough ends trimmed, stalks cut into 1-inch lengths",
      "Salt",
      "Handful of cilantro or basil leaves, for serving"
    ],
    "full_instructions": [
      "Heat the oil in a large skillet over medium heat until shimmering. Add the lemon wedges, peel-side down, and cook for 1 or 2 minutes to release their oils. Flip onto cut sides and cook until the flesh is browned and charred in spots, 3 to 6 minutes. Flip onto the other cut sides and repeat.",
      "Remove the lemon wedges, pour in the coconut milk and scrape to release all the charred bits stuck to the skillet. Stir in the beans and asparagus, season well with salt, and simmer until the asparagus is crisp-tender, 5 to 8 minutes. At first, the mixture might look thick, but there’s no need to add more liquid; the asparagus will release liquid as it cooks.",
      "Remove from heat and squeeze in the lemon. Season to taste with salt and serve topped with herbs."
    ]
  },
  {
    "name": "Grilled Shrimp With Spicy Slaw",
    "url": "https://cooking.nytimes.com/recipes/1024054-grilled-shrimp-with-spicy-slaw",
    "image": "https://static01.nyt.com/images/2023/05/03/multimedia/ya-spicy-cabbage-slaw-lvhp/ya-spicy-cabbage-slaw-lvhp-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "¼ cup freshly squeezed orange juice (from 1 orange)",
      "3 tablespoons freshly squeezed lime juice (from 2 limes)",
      "¼ cup neutral oil",
      "2 tablespoons honey",
      "2 tablespoons thinly sliced jalapeño (or more, to taste)",
      "½ teaspoon kosher salt (such as Diamond Crystal)",
      "1 pound large (16 to 20 count) peeled and deveined shrimp",
      "4 packed cups thinly shredded green cabbage (½ medium head)",
      "1 mango (optional), peeled and julienned",
      "1 cup chopped cilantro",
      "2 thinly sliced scallions"
    ],
    "full_instructions": [
      "Make the dressing: In a large bowl, whisk together the orange juice, lime juice, oil, honey, jalapeño and salt. Taste and add more jalapeño if you’d like more heat.",
      "Add 2 tablespoons of the dressing to a medium bowl and toss with the shrimp; let the shrimp marinate while you heat a grill or grill pan over medium-high.",
      "Reserve 2 tablespoons of the dressing from the large bowl, then add the cabbage, mango (if using), cilantro and scallions to the large bowl; toss to coat.",
      "Grill the shrimp until lightly charred and cooked through, about 3 minutes per side.",
      "Transfer the slaw to a serving platter. Set the shrimp on top and drizzle shrimp with the remaining 2 tablespoons of dressing; serve immediately."
    ]
  },
  {
    "name": "Salmon Teriyaki",
    "url": "https://cooking.nytimes.com/recipes/1024206-salmon-teriyaki",
    "image": "https://static01.nyt.com/images/2023/05/17/multimedia/as-teriyaki-salmon-pwlb/as-teriyaki-salmon-pwlb-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "4 (4- to 6-ounce) skin-on salmon fillets, patted dry",
      "Salt",
      "1 teaspoon neutral oil, such as canola or grapeseed",
      "2 tablespoons soy sauce",
      "2 tablespoons mirin",
      "2 tablespoons sake",
      "4 teaspoons dark brown sugar"
    ],
    "full_instructions": [
      "Season the salmon flesh lightly with salt, then coat the skin with oil. Place the salmon skin-side down in a large (12-inch) nonstick skillet. Turn the heat to medium and cook until the salmon is opaque halfway up the sides, 10 to 14 minutes. From time to time, press the salmon down with a spatula to help the skin make contact with the pan.",
      "Meanwhile, in a small bowl, stir together the soy sauce, mirin, sake and dark brown sugar.",
      "Reduce the heat to low, flip the salmon and pour the sauce into the skillet, making sure to get the sugar in the bottom of the bowl. Let the sauce simmer until it starts to thicken, about 1 minute. Continue to simmer and occasionally spoon the sauce over the salmon until the salmon is cooked through and the sauce is foamy and glazy, 1 to 3 more minutes. If the salmon is done before the sauce has thickened, transfer the salmon to a plate and continue to simmer the sauce until it resembles maple syrup. Pour the sauce over the salmon."
    ]
  },
  {
    "name": "Kale and Butternut Squash Bowl With Jammy Eggs",
    "url": "https://cooking.nytimes.com/recipes/1023835-kale-and-butternut-squash-bowl-with-jammy-eggs",
    "image": "https://static01.nyt.com/images/2023/01/18/multimedia/as-butternut-squash-and-kale-bowl-bmvh/as-butternut-squash-and-kale-bowl-bmvh-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "3 large eggs",
      "¾ cup plain, full-fat yogurt",
      "1 teaspoon lemon zest plus 2 tablespoons juice (from 1 lemon)",
      "2 teaspoons finely chopped fresh ginger",
      "1 teaspoon toasted sesame oil",
      "Salt",
      "12 ounces butternut, honeynut or kabocha squash, seeds removed and sliced ½-inch thick",
      "8 ounces broccoli, cauliflower or a combination, cut into 1-inch florets and stems, thinly sliced",
      "4 ounces (about 4 packed cups) torn kale leaves, or another hearty green like chard or mustard",
      "Toasted sesame seeds (any color), for serving"
    ],
    "full_instructions": [
      "In a large (12-inch) skillet with a lid or a large Dutch oven, bring 1 inch of water to a boil over high. Carefully add the eggs. (They may not be fully submerged and that’s OK.) Cover and boil for 6 minutes. Transfer the eggs to a bowl to cool. Pour off all but ¼ inch of water.",
      "While the eggs steam, in a liquid measuring cup or small bowl, stir together the yogurt, lemon zest and juice, ginger and sesame oil; season with salt. It might taste too puckery at this point, but it will balance out when on the vegetables.",
      "Arrange the squash in a single layer in the shallow water; season with salt. Cover, bring to a boil over high, and cook for 5 minutes. Scatter the broccoli on top of the squash, season with salt, then pile the kale on top of the broccoli and season with salt. If the water has evaporated, add another ¼ inch of water. Cover and cook until the squash is tender and the broccoli is bright green and crisp-tender, 2 to 4 minutes. Turn off the heat but keep the skillet covered while you peel the eggs.",
      "Peel and halve the eggs, then season with salt. Divide the vegetables and eggs between plates, then drizzle with plenty of sauce and scatter sesame seeds on top. The vegetables, eggs and sauce will keep for up to 4 days in the fridge and are good warm, room temperature or cold from the fridge."
    ]
  },
  {
    "name": "Sheet-Pan Mushroom Parmigiana",
    "url": "https://cooking.nytimes.com/recipes/1022803-sheet-pan-mushroom-parmigiana",
    "image": "https://static01.nyt.com/images/2021/12/06/dining/hm-sheet-pan-mushroom-parmigiana/hm-sheet-pan-mushroom-parmigiana-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "10 ounces cherry or grape tomatoes, halved (1 pint)",
      "2 garlic cloves, finely chopped",
      "Extra-virgin olive oil",
      "Kosher salt and black pepper",
      "8 portobello mushrooms, stems removed",
      "3 cups store-bought or homemade marinara sauce",
      "3 cups (12 ounces) shredded low-moisture mozzarella",
      "1 cup panko bread crumbs",
      "½ cup (½ ounce) basil leaves, finely chopped, plus more leaves for topping"
    ],
    "full_instructions": [
      "Heat oven to 425 degrees. Arrange the cherry tomatoes on a sheet pan, along with half the garlic, and drizzle with 1 to 2 tablespoons of olive oil. Season with ½ teaspoon of salt and ½ teaspoon of black pepper, and toss to coat the tomatoes.",
      "To the sheet pan, add the mushroom caps in between the tomatoes, gill side up, and drizzle each generously with olive oil. (Don’t skimp here, as the olive oil will add lots of rich flavor.) Scatter the mushrooms with the remaining garlic, and season each mushroom with salt and black pepper. Fill each mushroom with marinara sauce, and top with cheese. Place in the oven and roast for 15 to 20 minutes, until the cheese is melted, bubbly and golden.",
      "Meanwhile, heat a medium skillet over medium-high. Add 1 tablespoon of olive oil and add the bread crumbs, basil and ½ teaspoon of salt. Stir constantly for 2 to 3 minutes, until golden. Remove from heat immediately and transfer to a bowl or jar.",
      "To serve, transfer mushrooms to serving plates, along with a few of the roasted cherry tomatoes. Top each mushroom with the basil bread crumbs and scatter with a few basil leaves."
    ]
  },
  {
    "name": "Greek Chicken With Cucumber-Feta Salad",
    "url": "https://cooking.nytimes.com/recipes/1023135-greek-chicken-with-cucumber-feta-salad",
    "image": "https://static01.nyt.com/images/2022/04/18/dining/as-greek-chicken/as-greek-chicken-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "1½ cups plain Greek yogurt",
      "3 garlic cloves, finely grated",
      "Kosher salt (Diamond Crystal)",
      "Black pepper",
      "1 teaspoon dried oregano or mint",
      "2 pounds boneless, skinless chicken thighs, patted dry",
      "1½ pounds cucumbers (preferably Japanese, Persian or mini, seedless cucumbers)",
      "1 pound ripe tomatoes",
      "2 tablespoons extra-virgin olive oil, plus more as needed",
      "4 ounces feta, crumbled (about ¾ cup)",
      "½ cup Kalamata olives, pitted and halved"
    ],
    "full_instructions": [
      "In a large bowl, stir together the yogurt and garlic; season to taste with salt and pepper. Transfer ½ cup of the yogurt to a medium bowl and reserve for Step 5.",
      "Coat the chicken: To the large bowl, add the oregano and stir to combine. Season the chicken all over with 1½ teaspoons salt and a few grinds of pepper. Add the chicken to the large bowl and turn to coat; set aside.",
      "Start the salad: Smash the cucumbers with the side of your knife until craggy and split. Rip into ½- to 1-inch pieces and transfer to a colander placed in the sink. Slice or chop the tomatoes into bite-size pieces. Add to the cucumbers along with 1 ½ teaspoons salt. (It may seem like a lot of salt, but most will drain away.) Toss to combine and leave to drain.",
      "In a large nonstick or well-seasoned cast-iron skillet, heat the olive oil over medium. Scrape excess marinade off the chicken, then cook the chicken in batches, adding oil to the pan if necessary, until it’s well browned and releases from the pan, 5 to 7 minutes. Flip and cook until cooked through, another 5 to 7 minutes. Transfer to plates to rest. (For grilling info, see Tip.)",
      "To the medium bowl of yogurt, add the feta and mash with a fork until a chunky paste forms. Shake the cucumbers and tomatoes to get rid of any excess moisture. Add to the feta yogurt along with the olives and stir until coated. The balance is dependent on your produce and feta, so season to taste with salt and pepper until flavors are vivid. Eat alongside the chicken."
    ]
  },
  {
    "name": "Easiest Chicken Noodle Soup",
    "url": "https://cooking.nytimes.com/recipes/1020746-easiest-chicken-noodle-soup",
    "image": "https://static01.nyt.com/images/2019/12/23/dining/aw-easiest-chicken-noodle-soup/aw-easiest-chicken-noodle-soup-articleLarge-v2.jpg?w=1280&q=75",
    "ingredients": [
      "5 tablespoons extra-virgin olive oil",
      "1 pound ground chicken",
      "Salt and black pepper",
      "4 garlic cloves, roughly chopped",
      "1½ teaspoons ground coriander",
      "½ teaspoon celery seeds (optional)",
      "2 celery stalks, halved lengthwise, then sliced ½-inch thick",
      "1 large carrot, peeled and cut into ½-inch cubes",
      "1 large shallot, finely chopped",
      "1 tablespoon fresh thyme leaves (or 1 teaspoon dried thyme leaves)",
      "7 to 8 cups chicken stock, plus more as needed",
      "8 ounces dried egg noodles, cavatelli or other small shaped pasta",
      "Crème fraîche, chopped fresh parsley and dill, and lemon zest, for garnish"
    ],
    "full_instructions": [
      "In a large pot, heat 3 tablespoons oil over medium-high. Add the chicken, season generously with salt and pepper, and cook, breaking up with a wooden spoon, until starting to crumble, about 3 minutes. Add the garlic, coriander and celery seeds (if using), and cook, stirring frequently, until chicken is cooked through, about 2 minutes. Using a slotted spoon, scoop the chicken into a small lidded bowl (to retain moisture); cover and set aside.",
      "Add the celery, carrot, shallot, thyme and the remaining 2 tablespoons oil to the pot, season with salt and pepper, and cook, stirring, until slicked with fat, 3 minutes. Add the stock (7 cups for a stewlike soup or up to 8 cups for a brothy soup) and bring to a boil over high.",
      "Add noodles and cook over medium-high until al dente according to package directions. (If the noodles absorb a lot of liquid, add more broth according to taste.) Add the reserved chicken and any accumulated juices and heat until warmed, then season to taste with salt and pepper. Divide among bowls; top with a spoonful of crème fraîche, a fistful of torn herbs and lemon zest."
    ]
  },
  {
    "name": "Sausage Tortellini Soup",
    "url": "https://cooking.nytimes.com/recipes/1024144-sausage-tortellini-soup",
    "image": "https://static01.nyt.com/images/2023/04/25/multimedia/-as-sausage-tortellini-soup-kwpq/-as-sausage-tortellini-soup-kwpq-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "3 tablespoons extra-virgin olive oil",
      "12 to 16 ounces fully cooked chicken sausage, any flavor, cut into ½-inch pieces",
      "1 large fennel, bulb coarsely chopped, stalks thinly sliced, fronds finely chopped",
      "4 garlic cloves, chopped",
      "Salt and pepper",
      "1½ quarts (6 cups) chicken broth",
      "About 10 ounces fresh or frozen cheese, spinach or mushroom tortellini",
      "2 cups chopped vegetables (such as snap or snow peas, green beans, asparagus, kale, spinach or escarole), or frozen peas",
      "Grated Parmesan, for serving"
    ],
    "full_instructions": [
      "Heat the oil in a large pot or Dutch oven over medium-high. Add the sausage and cook, stirring once or twice, until browned and crisp all over, 6 to 8 minutes. Add the chopped fennel bulb and garlic, season with salt and pepper, and cook, scraping up the browned bits as you go, until softened, 5 to 7 minutes.",
      "Add the chicken broth and bring to a boil, then reduce heat and simmer until the broth is flavorful, 5 to 7 minutes. Scrape the browned bits from the bottom of the pot. Taste and season with salt and pepper.",
      "Add the tortellini and cook according to package directions. In the last three minutes of the tortellini cooking, add the chopped vegetables and up to ½ cup sliced fennel stalks. (For some tortellini, that might mean adding the vegetables with the pasta.)",
      "Remove from heat and stir in up to ¼ cup chopped fennel fronds. Serve in bowls topped with Parmesan and more black pepper."
    ]
  },
  {
    "name": "Miso Soup",
    "url": "https://cooking.nytimes.com/recipes/1023468-miso-soup",
    "image": "https://static01.nyt.com/images/2022/09/18/magazine/18mag-eat/18mag-eat-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "1 (5-inch) square kombu (dried kelp)",
      "1 tablespoon sake",
      "1 tablespoon mirin",
      "5 grams wakame (dried seaweed), crushed (¼ cup)",
      "2 cups loosely packed katsuobushi (often labeled “bonito flakes”)",
      "1 (14-ounce) package silken tofu, drained",
      "¼ cup miso (white or red; see Tip), plus more to taste",
      "1 large scallion, thinly sliced"
    ],
    "full_instructions": [
      "Make dashi, the soup base, by soaking kombu in 4 cups cold water for 15 minutes in a medium pot. Add the sake and mirin and bring to a simmer over high heat. As soon as the water starts to boil, take the pot off the heat, cover and let the kombu steep until the liquid smells like the sea, about 15 minutes.",
      "Meanwhile, in a small bowl, soak the wakame in about 3 inches of cold water until soft, about 15 minutes as well. Drain and set aside.",
      "When ready to serve, remove the kombu from the pot (see Tip). Stir the katsuobushi into the kombu broth, cover and let steep for 1 minute. Strain into a medium bowl, pressing down on the katsuobushi to extract all of the liquid; discard the spent flakes. This is your dashi.",
      "Return the dashi to the pot and add the drained wakame. Scoop the tofu into the pot using a spoon or your hand, leaving it in large chunks. Bring the soup to a boil, then remove from the heat.",
      "Add the miso to a small bowl, then ladle over some of the broth and stir to dissolve. Add the dissolved miso to the pot and gently stir until incorporated. Add the scallion, taste for seasoning (adding more miso if you’d like) and serve immediately."
    ]
  },
  {
    "name": "T’chicha (Barley and Tomato Soup)",
    "url": "https://cooking.nytimes.com/recipes/1024017-tchicha-barley-and-tomato-soup",
    "image": "https://static01.nyt.com/images/2023/03/09/multimedia/nb-tchicha-wtph/nb-tchicha-wtph-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "3 tablespoons olive oil, more to serve",
      "1 large yellow onion, diced into ¼-inch pieces",
      "1¼ cups pearl barley",
      "½ (14-ounce) can crushed tomatoes (or 2 medium tomatoes, cored and diced into ½-inch pieces)",
      "2 garlic cloves, grated",
      "2½ teaspoons sweet paprika",
      "1½ teaspoon fine sea salt or more to taste",
      "5 cups vegetable stock (or water)",
      "1 teaspoon dried thyme",
      "Fresh thyme for garnish (optional)"
    ],
    "full_instructions": [
      "Add the olive oil to a large pot over medium-low. Add the onion, cover the pan, and cook stirring occasionally, until the onion is soft and translucent, about 7 minutes.",
      "Add the pearl barley, canned tomatoes, garlic, sweet paprika, salt and stock. Bring to a boil over high. Reduce the heat to low, cover with a lid and leave to simmer for 45 minutes or until the barley is fully cooked. At this stage of the cooking process, you might need to add more water progressively to the pot to achieve a soup consistency.",
      "Stir in the dried thyme, taste, and adjust the seasoning with salt if necessary. Serve immediately with a generous drizzle of olive oil and a couple of fresh thyme sprigs, if desired."
    ]
  },
  {
    "name": "Lemony Greek Chicken, Spinach and Potato Stew",
    "url": "https://cooking.nytimes.com/recipes/1024015-lemony-greek-chicken-spinach-and-potato-stew",
    "image": "https://static01.nyt.com/images/2023/03/07/multimedia/sdg-lemony-chicken-stew-vjkz/sdg-lemony-chicken-stew-vjkz-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "¼ cup extra-virgin olive oil",
      "1 red or yellow onion, finely chopped",
      "8 large garlic cloves, smashed and finely chopped",
      "1½ teaspoons coarse kosher salt, plus more to taste",
      "1 pound ground chicken",
      "1 heaping tablespoon roughly chopped fresh rosemary (leaves of about 1 large sprig) or 1½ teaspoons dried rosemary",
      "1½ teaspoons dried oregano",
      "1 teaspoon red-pepper flakes",
      "Black pepper",
      "1½ pounds Yukon gold potatoes (about 3 medium), scrubbed and chopped into ½-inch chunks",
      "6 cups chicken broth",
      "Juice of 1 large lemon (about ¼ cup juice)",
      "1 (8-ounce) bunch mature spinach, stems included, chopped, or 1½ cups frozen leaf spinach",
      "¼ to ⅓ cup lightly packed roughly chopped dill",
      "Crumbled feta and crushed pita chips, for topping"
    ],
    "full_instructions": [
      "In a large pot or Dutch oven, warm the oil over high heat. Add the onion, garlic and salt and cook, stirring, until the onion and garlic are softened and just starting to brown, 5 minutes. (Decrease the heat to medium-high if necessary to prevent scorching.)",
      "Decrease the heat to medium-high and add the chicken, rosemary, oregano, red-pepper flakes and several generous grinds of black pepper. Cook, breaking up the chicken into crumbles, until the meat starts to lose its translucent pinkness and is turning white, about 2 minutes. Add the potatoes and stir well to combine. Add the chicken broth and half the lemon juice, scraping up any browned bits on the bottom. Bring to a rolling boil and then lower the heat to maintain a very brisk simmer. Simmer until the potatoes are nearly tender, 15 minutes.",
      "Add the spinach and dill, to taste. Continue to simmer briskly until the potatoes are tender, about 5 minutes more. Taste and add some or all of the remaining lemon juice, as well as more salt and pepper, if desired. Serve in bowls topped with feta and crushed pita chips."
    ]
  },
  {
    "name": "Pasta e Patate (Pasta and Potato Soup)",
    "url": "https://cooking.nytimes.com/recipes/1023564-pasta-e-patate-pasta-and-potato-soup",
    "image": "https://static01.nyt.com/images/2022/10/20/dining/nd-pasta-e-patate/merlin_213671247_9054a84c-236d-4474-852b-62daf7ea4ae0-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "⅓ cup extra-virgin olive oil",
      "1 large yellow onion, finely chopped",
      "1 large carrot, scrubbed and finely chopped",
      "1 large celery stalk, finely chopped",
      "2 garlic cloves, finely chopped",
      "2 ounces finely chopped pancetta or bacon (about ½ cup)",
      "Kosher salt (Diamond Crystal) and black pepper",
      "3 medium Yukon Gold potatoes (about 1¼ pounds), peeled and chopped into 1-inch pieces",
      "1 rosemary sprig",
      "1 (2-inch) piece Parmesan rind",
      "6 ounces spaghetti (a little more than ¼ of a box), broken into fourths",
      "Grated Parmesan or pecorino, to serve"
    ],
    "full_instructions": [
      "In a large pot, heat the oil over medium. Add the onion, carrot, celery, garlic and pancetta; season with a good pinch of salt and cook, stirring occasionally, until the vegetables have softened, about 10 minutes.",
      "Add the potatoes and rosemary, season with salt and pepper and cook, stirring occasionally, just until the potatoes are no longer completely raw and the rosemary is fragrant, about 2 minutes. Cover with 6 cups of water, then add the Parmesan rind and season to taste with salt and pepper. Stir, scraping up any bits that may have stuck to the bottom of the pot, and bring to a gentle boil. Partially cover, reduce heat to medium-low and simmer until the potatoes have completely softened, 15 to 20 minutes.",
      "With the back of a wooden spoon, smush a few of the potatoes against the side of the pot, then taste the broth and adjust seasoning. Add the pasta, raise the heat to medium-high and bring to a gentle boil. Reduce the heat to medium-low and simmer uncovered, stirring occasionally, until the pasta is cooked through, about 12 minutes. Keep an eye on the liquid amount. If you prefer a thinner soup, add more water as needed. If you prefer a thicker broth, you can smoosh more potatoes for a starchier consistency, but be mindful that the soup will thicken significantly as it sits (see Tip).",
      "Remove the rosemary sprig and Parmesan rind, and serve the soup with grated Parmesan or pecorino, and more black pepper, if you like."
    ]
  },
  {
    "name": "Sopa de Fideo",
    "url": "https://cooking.nytimes.com/recipes/1022957-sopa-de-fideo",
    "image": "https://static01.nyt.com/images/2022/02/02/dining/jr-sopa-de-fideo/merlin_200578182_fe1b8db9-f555-4953-809e-f3598febfcb5-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "4 large garlic cloves, peeled",
      "1 pound beefsteak tomatoes, quartered",
      "½ teaspoon red-pepper flakes",
      "1 tablespoon ground cumin",
      "1 tablespoon coarse kosher salt",
      "¼ cup neutral cooking oil, such as grapeseed",
      "8 ounces 1-inch fideo (3 cups)",
      "2 celery stalks, whole",
      "1 carrot, whole",
      "1 dried bay leaf"
    ],
    "full_instructions": [
      "Add the garlic, tomatoes, red-pepper flakes, cumin and salt to a blender, and blend until smooth. Set aside.",
      "Heat a medium pot over medium, then add the oil. Add the fideo to the hot oil and cook until toasted and aromatic, about 5 minutes. Be sure to constantly mix the fideo so it toasts evenly.",
      "Reduce the heat to low, then add the blended tomato mixture.",
      "Add 5 cups of water to the pot, along with the celery, carrot and bay leaf. Mix and taste for salt, adjusting if necessary.",
      "Increase to medium heat until simmering, then reduce to medium-low. Cook for 25 minutes, stirring occasionally, until the fideo is cooked through, the soup has melded together and the liquid has thickened.",
      "Remove the celery, carrot and bay leaf, and discard. Serve soup in bowls and top with any of your favorite sopa de fideo toppings."
    ]
  },
  {
    "name": "Baked Potato Soup",
    "url": "https://cooking.nytimes.com/recipes/1019913-baked-potato-soup",
    "image": "https://static01.nyt.com/images/2019/01/14/dining/as-baked-potato-soup/as-baked-potato-soup-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "6 slices bacon, or 3 tablespoons unsalted butter",
      "1 bunch scallions, white and green parts thinly sliced separately",
      "4 garlic cloves, minced",
      "2 pounds russet potatoes, peeled and cut into ½-inch cubes, large skins reserved",
      "6 cups whole milk",
      "Kosher salt (such as Diamond Crystal) and black pepper",
      "1 tablespoon extra-virgin olive oil, plus more as needed",
      "⅛ teaspoon ground cayenne",
      "⅛ teaspoon garlic powder",
      "¾ cup sour cream, plus more for serving",
      "¾ cup freshly grated Cheddar (about 3 ounces), plus more for serving"
    ],
    "full_instructions": [
      "In a large soup pot or Dutch oven over medium heat, cook the bacon (if using) until crisp, 12 to 13 minutes. Transfer the bacon to a paper-towel lined plate or cutting board. Return the pot with just 3 tablespoons of the bacon fat to the stove. (If there’s not enough fat, supplement with butter to total 3 tablespoons.) If making the soup vegetarian, melt butter in a large soup pot or Dutch oven over medium heat.",
      "Over medium-low heat, sauté the white parts of the scallions and the garlic until golden brown, 2 to 3 minutes, stirring frequently and adjusting the heat as necessary to avoid burning the garlic. Add the potatoes, milk and 2 teaspoons salt, and bring to a boil over medium-high heat (resist the urge to heat it faster as this can lead to curdling). Once at a boil, lower the heat and simmer covered until the potatoes are tender, 10 to 15 minutes.",
      "As soup simmers, prepare the potato skins: Warm the olive oil over medium-high heat in a large skillet. Working in batches if needed, add the potato peels in a single layer and cook, flipping once, until crisp and golden-brown, about 3 minutes. Transfer to a paper towel-lined plate or cutting board, then sprinkle with salt, pepper, cayenne and garlic powder. Crumble and set aside.",
      "Once the potatoes are tender, take the pot off the heat, and purée the mixture with an immersion blender if you’d like a smooth soup. (Mash with a potato masher if you’d like a chunkier soup.) Stir in the sour cream and cheese until combined, then season with salt and pepper. Serve topped with crumbled bacon, more sour cream and Cheddar and the green parts of the scallions. Top with potato peels (eat any extra as chips, dipped in ketchup and mustard)."
    ]
  },
  {
    "name": "Tomato-Lentil Soup With Goat Cheese",
    "url": "https://cooking.nytimes.com/recipes/1023962-tomato-lentil-soup-with-goat-cheese",
    "image": "https://static01.nyt.com/images/2023/02/27/multimedia/AS-Red-Lentil-Soup-With-Herbed-Goat-Cheese--ztkl/AS-Red-Lentil-Soup-With-Herbed-Goat-Cheese--ztkl-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "3 tablespoons unsalted butter or olive oil",
      "1 (4½ ounce) tube double concentrate tomato paste or 6 ounces (1 can) tomato paste",
      "3 garlic cloves, finely grated",
      "1½ teaspoons ground coriander",
      "1 teaspoon Italian seasoning, za’atar or dried oregano",
      "½ teaspoon red-pepper flakes, plus more for serving",
      "1 cup red lentils",
      "Kosher salt (Diamond Crystal)",
      "1 lemon",
      "4 ounces regular or herb goat cheese, cut into 8 slices"
    ],
    "full_instructions": [
      "In a large Dutch oven, melt the butter over medium. Add the tomato paste, garlic, coriander, ½ teaspoon Italian seasoning and the red-pepper flakes. Stir until the tomato paste is a shade darker and sticking to the bottom of the pot, 2 to 4 minutes. (Try not to rush this step; it’s where the flavor of the soup develops.)",
      "Add 4 ½ cups of water, the lentils and 1 teaspoon salt. Increase heat to medium-high, scrape any browned bits stuck to the pot and stir to break up the big chunks of tomato paste. Partially cover the pot and bring to a simmer, then completely cover, reduce heat to medium-low, and cook until the lentils start to break down and lose their shape, 15 to 20 minutes. Stir occasionally and scrape any stuck lentils from the bottom of the pot.",
      "Meanwhile, zest the lemon into a small bowl. Cut the lemon into wedges for serving. Add the remaining ½ teaspoon Italian seasoning to the lemon zest and season with salt and more red-pepper flakes. Rub with your fingers until you smell lemon; set aside.",
      "Turn off the heat under the lentils. Season to taste with salt. Place the goat cheese on top of the lentils, then sprinkle the goat cheese with the lemon-herb mixture. Cover the pot and let sit until the goat cheese is softened, 3 to 5 minutes. Serve the soup with a lemon wedge for squeezing over."
    ]
  },
  {
    "name": "Honey-Glazed Mushrooms With Udon",
    "url": "https://cooking.nytimes.com/recipes/1022833-honey-glazed-mushrooms-with-udon",
    "image": "https://static01.nyt.com/images/2021/12/20/dining/hm-udon-with-mushrooms/merlin_198267651_b4239cd5-34bb-4f3d-9fc0-7ca9ab7e12e4-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "Kosher salt (Diamond Crystal)",
      "1½ pounds fresh or frozen udon noodles (vacuum-sealed)",
      "2 tablespoons neutral oil, such as vegetable or grapeseed",
      "1 pound cremini mushrooms, stemmed and sliced into ¼-inch pieces",
      "4 garlic cloves, finely chopped",
      "Black pepper",
      "3 tablespoons honey",
      "4 tablespoons butter, preferably salted (see Tip)",
      "½ small head Napa cabbage, finely sliced (about 1 pound)",
      "3 tablespoons soy sauce",
      "2 scallions, finely sliced",
      "1 tablespoon sesame seeds, toasted"
    ],
    "full_instructions": [
      "Bring a large pot of salted water to a boil, add the udon noodles and cook for about 2 minutes, using wooden chopsticks or tongs to gently loosen the noodles from their tight bundle. Drain, rinse with cold water and leave to continue draining while you prepare the remaining ingredients.",
      "Heat a wok or large (12-inch) skillet on medium-high, until very hot. Add oil and mushrooms, and stir-fry for 7 to 8 minutes, leaving undisturbed for 30 seconds to 1 minute at a time, to allow them to caramelize. (Be patient: They will release a lot of liquid, then start to brown.) Add the garlic, ½ teaspoon salt and a few turns of black pepper. Drizzle the mushrooms with 2 tablespoons of honey, then add 3 tablespoons of butter and toss.",
      "Add the udon noodles, Napa cabbage and soy sauce to the pan, then toss for 2 minutes, until the cabbage is wilted and everything is well combined. Remove from the heat and add the remaining 1 tablespoon honey and 1 tablespoon butter. Taste and season with more salt and black pepper, if required. To serve, scatter with scallions and sesame seeds."
    ]
  },
  {
    "name": "Gochujang Buttered Noodles",
    "url": "https://cooking.nytimes.com/recipes/1024066-gochujang-buttered-noodles",
    "image": "https://static01.nyt.com/images/2023/03/31/multimedia/31-GOCHUJANGREX1-gochujang-buttered-noodles-zqlg/31-GOCHUJANGREX1-gochujang-buttered-noodles-zqlg-articleLarge-v2.jpg?w=1280&q=75",
    "ingredients": [
      "1 pound spaghetti or other long pasta",
      "6 tablespoons unsalted butter",
      "12 garlic cloves, finely chopped (about ⅓ cup)",
      "Kosher salt and black pepper",
      "¼ cup gochujang paste (not sauce; see Tip)",
      "¼ cup honey",
      "¼ cup sherry vinegar or rice vinegar",
      "Finely chopped cilantro or thinly sliced scallions (optional)"
    ],
    "full_instructions": [
      "Bring a large pot of water to a boil. Add the spaghetti and cook according to package instructions. Reserve 1 cup of the cooking water. Drain the spaghetti and return to its pot.",
      "While the pasta cooks, melt 4 tablespoons of the butter in a skillet over medium-low. Add the garlic and season generously with salt. Cook, stirring occasionally, until the garlic starts to soften but not brown, 1 to 3 minutes.",
      "Stir in the gochujang, honey and vinegar, and bring to a simmer over medium-high. Cook, stirring constantly, until the mixture reduces significantly, 3 to 4 minutes; when you drag a spatula across the bottom of the pan, it should leave behind a trail that stays put for about 3 seconds. Remove from the heat.",
      "Transfer the sauce to the pot with the spaghetti and add the remaining 2 tablespoons butter. Vigorously stir until the butter melts. Add splashes of the pasta cooking water, as needed, to thin out the sauce. Taste and season with salt and pepper. Top with the cilantro or scallions (if using) and serve immediately."
    ]
  },
  {
    "name": "Zucchini Tofu Udon",
    "url": "https://cooking.nytimes.com/recipes/1024370-zucchini-tofu-udon",
    "image": "https://static01.nyt.com/images/2023/07/11/multimedia/hm-udon-with-zucchini-vhgq/hm-udon-with-zucchini-vhgq-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "1½ pounds (4 blocks) fresh, vacuum-sealed udon noodles",
      "4 tablespoons unsalted butter, melted",
      "4 tablespoons white fuyu (fermented tofu), plus optional 1 tablespoon of the brine (see Tip) (or white miso)",
      "2 tablespoons soy sauce",
      "Extra virgin olive oil",
      "1 (14-ounce) package extra-firm tofu, drained and crumbled",
      "1 teaspoon kosher salt (such as Diamond Crystal), plus more to taste",
      "2 medium zucchini (12 ounces), trimmed and cut into ¼ inch batons",
      "2 garlic cloves, finely chopped",
      "1 teaspoon freshly ground black pepper",
      "2 scallions, trimmed and finely sliced"
    ],
    "full_instructions": [
      "Bring a large pot of salted water to a boil, add the udon noodles and cook for about 2 minutes, using wooden chopsticks or tongs to gently loosen the noodles from their tight bundle. Drain, rinse with cold water and leave to continue draining while you prepare the remaining ingredients.",
      "Meanwhile, place the melted butter, fuyu and soy sauce in a bowl and whisk together until smooth. If the mixture looks too thick, add 1 tablespoon of the fuyu brine or water to loosen up the mixture. Set aside.",
      "Heat a large 12-inch skillet or wok on medium high. When hot, add 1 to 2 tablespoons of olive oil, along with the tofu and salt and toss for 2 to 3 minutes until the tofu has released some of its liquid. Add the zucchini and garlic and toss for 2 minutes until it has softened.",
      "Add the udon, the butter-fuyu mixture and black pepper and toss well to combine. Stir-fry for 2 minutes, until the noodles are heated through.",
      "To serve, top with scallions."
    ]
  },
  {
    "name": "Tahini Ramen Salad",
    "url": "https://cooking.nytimes.com/recipes/1024037-tahini-ramen-salad",
    "image": "https://static01.nyt.com/images/2023/04/13/multimedia/kc-tahini-ramen-salad-qflh/kc-tahini-ramen-salad-qflh-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "12 ounces dry ramen noodles (or four 3-ounce individual packages, seasoning packets discarded or reserved for another use)",
      "6 tablespoons tahini",
      "6 tablespoons extra-virgin olive oil",
      "¼ cup distilled white vinegar",
      "2 tablespoons minced ginger",
      "2 tablespoons sweet miso",
      "1 tablespoon minced garlic",
      "Kosher salt and black pepper",
      "1 (15-ounce) can chickpeas, rinsed",
      "4 cups thinly sliced vegetables (such as yellow bell pepper, cucumbers, radishes and snap peas)",
      "½ cup thinly sliced scallions"
    ],
    "full_instructions": [
      "In a medium pot of boiling water, cook the ramen noodles according to package directions until al dente. Drain, rinse under cold water until cool, then drain well; transfer to a large bowl.",
      "In a small bowl, combine tahini, oil, vinegar, ginger, miso, garlic and ¼ cup of water. Season with salt and pepper and whisk until smooth.",
      "Add ½ cup of the dressing to the noodles, season and toss to coat. Add chickpeas, sliced vegetables, scallions and remaining dressing; season and toss to coat. Serve at room temperature or chilled."
    ]
  },
  {
    "name": "Vegetable Yakisoba ",
    "url": "https://cooking.nytimes.com/recipes/1022780-vegetable-yakisoba",
    "image": "https://static01.nyt.com/images/2022/01/04/dining/kc-vegetable-yakisoba/kc-vegetable-yakisoba-articleLarge-v4.jpg?w=1280&q=75",
    "ingredients": [
      "1 pound frozen presteamed yakisoba noodles, thawed",
      "3 tablespoons neutral oil, such as safflower or canola",
      "1 small yellow onion, thinly sliced",
      "2 medium carrots, peeled and cut into matchsticks",
      "1 large red bell pepper, stemmed, cored and thinly sliced",
      "Kosher salt and black pepper",
      "1 tablespoon minced garlic",
      "8 ounces shiitake mushrooms, stemmed and thinly sliced",
      "8 ounces baby kale",
      "1 cup thinly sliced scallions",
      "3 tablespoons oyster sauce",
      "3 tablespoons low-sodium soy sauce",
      "2 tablespoons Worcestershire sauce",
      "1 tablespoon neutral oil, such as safflower or canola",
      "1 tablespoon ketchup",
      "2 teaspoons granulated sugar",
      "¼ teaspoon grated fresh ginger",
      "¼ teaspoon black pepper"
    ],
    "full_instructions": [
      "Make the yakisoba: Place yakisoba noodles in a colander and rinse under room-temperature water. Using your hands, gently loosen and separate noodles. Drain well.",
      "In a 12-inch high-sided nonstick skillet, heat 1 tablespoon of the oil over medium-high. Add noodles and spread in an even layer; cook undisturbed until golden and charred in spots, 3 minutes. Stir noodles once, then cook undisturbed until golden and charred in spots on the other side, 2 minutes longer. Transfer to a large plate.",
      "Meanwhile, make the sauce: In a small bowl combine all of the ingredients and mix well.",
      "To the skillet over medium, add the remaining 2 tablespoons oil, onion, carrot and bell pepper, and season with salt and pepper. Cook, stirring occasionally, until the vegetables are softened and charred in spots, 5 minutes. Stir in garlic until well combined, then add mushrooms and cook, stirring occasionally, until vegetables are tender and light golden, 3 to 5 minutes. Stir in kale in batches until wilted. Add the noodles, sauce and all but ¼ cup of the scallions, and cook, stirring occasionally, until sauce is absorbed, about 3 minutes. (Noodles should be nicely coated in the sauce but not soupy.) Season with salt and pepper.",
      "Divide yakisoba among 4 plates and garnish with the remaining scallions. Serve warm."
    ]
  },
  {
    "name": "Sesame-Brown Butter Udon Noodles",
    "url": "https://cooking.nytimes.com/recipes/1023588-sesame-brown-butter-udon-noodles",
    "image": "https://static01.nyt.com/images/2022/11/28/dining/as-sesame-brown-butter-udon-noodles/as-sesame-brown-butter-udon-noodles-articleLarge-v3.jpg?w=1280&q=75",
    "ingredients": [
      "Salt",
      "14 to 16 ounces udon, preferably thick fresh, frozen or shelf-stable noodles",
      "1 pound baby spinach or coarsely chopped or torn mature spinach",
      "6 tablespoons unsalted butter",
      "1 teaspoon coarsely ground black pepper, plus more for serving",
      "1 tablespoon low-sodium soy sauce, plus more as needed",
      "Pinch of granulated sugar",
      "2 tablespoons toasted sesame seeds, plus more for serving"
    ],
    "full_instructions": [
      "Bring a large pot of salted water to a boil. Add the noodles and cook according to package directions until just tender. Reserve 1 cup cooking water, then add the spinach and press to submerge. (It will continue cooking later.) Drain the noodles and spinach, shaking to get rid of any excess water.",
      "Set the pot over medium heat. Add 5 tablespoons butter and cook, stirring occasionally, until the foam subsides, the milk solids turn golden-brown and it smells nutty and toasty, 3 to 4 minutes. Add the black pepper and stir until fragrant. Add ¼ cup pasta water, plus the noodles and spinach, soy sauce and sugar, and toss until the sauce is thickened and silky. Add pasta water, 1 tablespoon at a time, until the sauce clings to the noodles.",
      "Remove from heat, add the sesame seeds and stir in the remaining 1 tablespoon butter until melted. Season to taste with more soy sauce and black pepper (if mild) and sugar (if too salty). Serve with more sesame seeds on top."
    ]
  },
  {
    "name": "Soy Sauce Noodles With Cabbage and Fried Eggs",
    "url": "https://cooking.nytimes.com/recipes/1023889-soy-sauce-noodles-with-cabbage-and-fried-eggs",
    "image": "https://static01.nyt.com/images/2023/01/30/multimedia/hm-soy-sauce-noodles-with-cabbage-mpwf/hm-soy-sauce-noodles-with-cabbage-mpwf-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "Kosher salt",
      "7 ounces dried (or 16 ounces fresh) thin egg noodles",
      "Neutral oil, such as vegetable or grapeseed",
      "4 large eggs",
      "½ small green cabbage (1½ pounds), core removed then thinly sliced",
      "1 bunch scallions (about 8 stems), white and green parts separated and cut into 2-inch segments",
      "White pepper",
      "Toasted white sesame seeds, optional",
      "2 tablespoons soy sauce",
      "2 tablespoons dark soy sauce (or tamari)",
      "1 tablespoon toasted sesame oil"
    ],
    "full_instructions": [
      "Prepare the noodles: Bring a large pot of salted water to a boil. Add the noodles and stir to loosen them up. Cook, according to package instructions until just tender, then rinse under running water until cold. Drain and set aside.",
      "Make the seasoning: Mix together the soy sauce, dark soy sauce and sesame oil along with 3 tablespoons of water. Set aside.",
      "Finish the noodles: Heat a wok or large well-seasoned cast iron or nonstick skillet over medium high. When hot, add a drizzle of oil and crack in the eggs, adding however many will comfortably fit in your pan; you may need to work in batches. Reduce the heat to medium and fry until the edges are frizzled, the whites are set and the yolk is cooked to your liking. Season with a pinch of salt. Remove and repeat with the remaining eggs. Set aside.",
      "To the same pan, add 2 tablespoons of oil. Add the cabbage and season with ½ teaspoon of salt. Toss the cabbage until it has softened and reduced significantly in size, 2 to 3 minutes. Add the white part of the scallions and toss for 2 minutes until they have softened. Add the noodles and soy sauce seasoning, and toss for 2 minutes until well coated. Add the green parts of scallions and toss for 1 to 2 minutes until wilted. Turn off the heat and add ½ teaspoon of white pepper.",
      "To serve, place noodles in serving bowls and top with toasted sesame seeds, if using, and a fried egg."
    ]
  },
  {
    "name": "Salmon Soba Noodles With Ponzu-Scallion Sauce",
    "url": "https://cooking.nytimes.com/recipes/1023113-salmon-soba-noodles-with-ponzu-scallion-sauce",
    "image": "https://static01.nyt.com/images/2022/04/06/dining/kc-salmon-soba-noodles/kc-salmon-soba-noodles-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "8 ounces Napa cabbage, chopped into 1-inch pieces (3 packed cups)",
      "2 tablespoons instant dashi powder (such as Hondashi, see Tip)",
      "Salt and black pepper",
      "12 ounces dry soba noodles",
      "1 cup thinly sliced scallions",
      "3 tablespoons ponzu",
      "2 tablespoons neutral oil, such as safflower or canola oil",
      "1 teaspoon minced fresh ginger",
      "8 ounces firm tofu, cut into ½-inch cubes",
      "1 pound center-cut skinless salmon fillet, halved down the center and each piece sliced crosswise ¼-inch thick",
      "8 ounces daikon, peeled and finely grated (1 cup)"
    ],
    "full_instructions": [
      "In a large pot, combine cabbage, dashi powder and 8 cups of water, and bring to boil over high heat. Partially cover, reduce heat to medium and simmer, stirring occasionally, until cabbage is tender and flavors have melded, about 10 minutes. Season with salt and pepper to taste.",
      "Meanwhile, bring a separate pot of water to a boil and cook soba noodles according to package instructions. Drain and run under cool water to remove excess starch and to stop the cooking. Drain well and divide soba among 4 bowls.",
      "In a small bowl, mix scallions with ponzu, oil and ginger and set aside. Once cabbage is tender, add tofu and bring broth back to a gentle simmer. Reduce heat to low and arrange salmon slices on top so that they’re slightly overlapping and just covered by the broth. Cover and cook until salmon is just opaque throughout, 1½ to 2 minutes. (The fish will continue to cook off the heat.)",
      "Divide broth and salmon among the 4 bowls. Top each serving with some of the grated daikon and spoon some of the ponzu-scallions sauce over the fish and broth. Serve warm with any remaining ponzu-scallion sauce on the side."
    ]
  },
  {
    "name": "Creamy Vegan Tofu Noodles",
    "url": "https://cooking.nytimes.com/recipes/1021508-creamy-vegan-tofu-noodles",
    "image": "https://static01.nyt.com/images/2020/12/08/dining/hm-tofu-noodles/merlin_180213513_4ffbdd61-1afd-4515-91be-28125b677999-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "¾ teaspoon kosher salt, plus more as needed",
      "12 ounces thick Chinese wheat noodles",
      "1 (14-ounce) package firm tofu, broken into pieces",
      "2 garlic cloves, sliced",
      "½ teaspoon granulated sugar",
      "½ teaspoon five-spice powder",
      "½ cup finely chopped cilantro leaves and tender stems, plus a few sprigs for serving",
      "2 teaspoons sesame oil",
      "Toasted white sesame seeds, for garnish",
      "2 tablespoons Chinkiang vinegar (black vinegar), or a combination of 4 teaspoons rice wine vinegar plus 2 teaspoons soy sauce",
      "1 tablespoon soy sauce",
      "1 tablespoon chile oil or chile crisp, such as Chiu Chow chile oil",
      "1 scallion, finely chopped",
      "1 (½-inch) piece fresh ginger, peeled and finely chopped"
    ],
    "full_instructions": [
      "Prepare the noodles: Bring a large pot of salted water to a boil. Add the noodles and cook according to package instructions until the noodles are just tender, about 6 minutes. Drain, rinse with cold water and drain well again.",
      "As noodles cook, prepare the topping: Add vinegar, soy sauce, chile oil, scallion, ginger and 1 tablespoon water to a small bowl and stir to combine.",
      "Place the tofu, garlic, sugar, five-spice and ¾ teaspoon salt into a blender or food processor and blend, adding about 6 tablespoons of water, 1 tablespoon at a time, until the sauce is completely smooth and creamy. (You may need up to 12 tablespoons of water, depending on your tofu.)",
      "Place the noodles in a large bowl and pour the tofu sauce on top. Add the cilantro and sesame oil, and toss until coated.",
      "To serve, divide the noodles among bowls. Top with the spicy soy-vinegar sauce, sesame seeds and cilantro sprigs."
    ]
  },
  {
    "name": "Roasted Salmon Glazed With Brown Sugar and Mustard",
    "url": "https://cooking.nytimes.com/recipes/1017244-roasted-salmon-glazed-with-brown-sugar-and-mustard",
    "image": "https://static01.nyt.com/images/2021/02/07/dining/sifton-brown-sugar-mustard-salmon-horizontal/merlin_142427754_87be060f-648e-4783-a9ab-dec1ff12b722-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "Salmon fillets, preferably wild or farmed organically",
      "Dijon mustard",
      "Brown sugar",
      "Salt and black pepper"
    ],
    "full_instructions": [
      "Heat your oven to 400 degrees.",
      "Make a mixture of Dijon mustard and brown sugar to the degree of spicy-sweetness that pleases you. Salt and pepper the salmon fillets.",
      "Place the salmon fillets skin-side down on a lightly oiled, foil-lined baking sheet. Slather the tops of the fillets with the mustard and brown sugar glaze and slide them into the top half of your oven. Roast for about 12 minutes, then serve."
    ]
  },
  {
    "name": "Baked Salmon and Dill Rice",
    "url": "https://cooking.nytimes.com/recipes/1023910-baked-salmon-and-dill-rice",
    "image": "https://static01.nyt.com/images/2023/04/12/multimedia/nd-baked-salmon-and-dill-rice-vzkq/nd-baked-salmon-and-dill-rice-vzkq-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "2 tablespoons extra-virgin olive oil",
      "1½ cups white basmati rice, rinsed and drained",
      "Kosher salt (such as Diamond Crystal) and black pepper",
      "4 ounces fresh dill, tough stems removed and finely chopped (about 1 cup), or ⅓ cup dried, plus more for serving",
      "2 large garlic cloves, finely grated",
      "1 large lemon, zested (about 1 teaspoon)",
      "1 tablespoon mayonnaise",
      "1 tablespoon honey",
      "¼ teaspoon ground turmeric",
      "¼ teaspoon red-pepper flakes, plus more for serving",
      "4 (6-ounce) salmon fillets (1 inch thick at their thickest parts), skin on or off"
    ],
    "full_instructions": [
      "Place an oven rack in the center position and heat the oven to 400 degrees. In a kettle or a small saucepan, bring 2¾ cups water to a boil.",
      "To a 9-by-13-inch baking pan, add the olive oil and spread it around the pan. Add the rice, 1 teaspoon salt and the dill, and stir to combine. Spread the rice evenly across the pan. Add the boiling water, stir and cover tightly with foil. Place in the oven and bake until most of the water has been absorbed, 12 to 15 minutes.",
      "Meanwhile, in a small bowl, combine the garlic, lemon zest, mayonnaise, honey, turmeric and red-pepper flakes. Season both sides of the salmon fillets well with salt (about 1½ teaspoons total) and pepper. Spread the mayonnaise paste on top (or flesh side) of the salmon fillets.",
      "Remove the pan from the oven and very carefully lift the foil. Place the salmon fillets on top of the rice, paste side up, reseal and place back in the oven. Bake until the rice is fluffy and the salmon is tender, 15 to 20 minutes. Garnish with more fresh dill and red-pepper flakes."
    ]
  },
  {
    "name": "Salmon Teriyaki",
    "url": "https://cooking.nytimes.com/recipes/1024206-salmon-teriyaki",
    "image": "https://static01.nyt.com/images/2023/05/17/multimedia/as-teriyaki-salmon-pwlb/as-teriyaki-salmon-pwlb-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "4 (4- to 6-ounce) skin-on salmon fillets, patted dry",
      "Salt",
      "1 teaspoon neutral oil, such as canola or grapeseed",
      "2 tablespoons soy sauce",
      "2 tablespoons mirin",
      "2 tablespoons sake",
      "4 teaspoons dark brown sugar"
    ],
    "full_instructions": [
      "Season the salmon flesh lightly with salt, then coat the skin with oil. Place the salmon skin-side down in a large (12-inch) nonstick skillet. Turn the heat to medium and cook until the salmon is opaque halfway up the sides, 10 to 14 minutes. From time to time, press the salmon down with a spatula to help the skin make contact with the pan.",
      "Meanwhile, in a small bowl, stir together the soy sauce, mirin, sake and dark brown sugar.",
      "Reduce the heat to low, flip the salmon and pour the sauce into the skillet, making sure to get the sugar in the bottom of the bowl. Let the sauce simmer until it starts to thicken, about 1 minute. Continue to simmer and occasionally spoon the sauce over the salmon until the salmon is cooked through and the sauce is foamy and glazy, 1 to 3 more minutes. If the salmon is done before the sauce has thickened, transfer the salmon to a plate and continue to simmer the sauce until it resembles maple syrup. Pour the sauce over the salmon."
    ]
  },
  {
    "name": "Green Curry Salmon With Coconut Rice",
    "url": "https://cooking.nytimes.com/recipes/1023826-green-curry-salmon-with-coconut-rice",
    "image": "https://static01.nyt.com/images/2023/01/18/multimedia/11Apperex-Salmon-wqhp/11Apperex-Salmon-wqhp-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "1¼ to 1½ pounds skinless salmon fillets",
      "Fine sea salt and freshly ground black pepper",
      "4 tablespoons green curry paste",
      "2 tablespoons virgin coconut oil (or use a neutral oil, such as canola)",
      "1 bunch scallions, whites and greens, thinly sliced",
      "2 garlic cloves, finely grated or minced",
      "1 (14½-ounce) can unsweetened, full-fat coconut milk",
      "1¾ cups sushi rice or other short-grain rice, rinsed well",
      "2 cups chopped baby spinach",
      "1 cup chopped cilantro leaves and tender stems",
      "Lime wedges, for serving"
    ],
    "full_instructions": [
      "Lightly season salmon with salt and pepper, and spread 1 tablespoon curry paste all over the fillets. Set aside.",
      "Heat oil in a 5- or 6-quart Dutch oven over medium. Stir in scallion whites and most of the greens, reserving 2 tablespoons scallion greens for garnish. Cook until golden brown, about 3 minutes. Stir in garlic and a pinch of salt, and cook until fragrant, about 1 minute longer.",
      "Stir in coconut milk, remaining 3 tablespoons green curry, 1½ cups water and 1½ teaspoons salt. Stir in rinsed rice and reduce heat to low. Let simmer, covered and stirring occasionally, for 20 minutes. Using a wooden spoon, gently fold in spinach, cilantro and a pinch of salt. If the rice looks dry and threatens to stick to the bottom of the pot, stir in 2 to 4 tablespoons more water.",
      "Place salmon filets on top of rice, raise heat to medium-low and cook, covered, until salmon is just cooked through, 12 to 20 minutes, depending on thickness.",
      "Remove from heat and taste rice for doneness. If the salmon is done before the rice, gently remove the fish from the pan using a metal spatula, transfer to a plate and tent with an overturned bowl or foil to keep warm, then continue to cook rice until tender, adding more water if the rice seems dry. Taste and season with salt as needed. Squeeze a lime wedge over the salmon and serve immediately, garnished with reserved scallions and more lime wedges on the side."
    ]
  },
  {
    "name": "Roasted Gochujang Salmon",
    "url": "https://cooking.nytimes.com/recipes/1024116-roasted-gochujang-salmon",
    "image": "https://static01.nyt.com/images/2023/06/09/multimedia/sl-gochujang-salmon-qlkh/sl-gochujang-salmon-qlkh-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "4 (6-ounce) boneless, skin-on or skinless salmon fillets",
      "3 garlic cloves, grated",
      "2 tablespoons gochujang",
      "1 tablespoon doenjang or dark miso",
      "1½ teaspoons granulated sugar"
    ],
    "full_instructions": [
      "Heat the oven to 400 degrees.",
      "Rinse salmon fillets, then pat them dry with paper towels. Place the fillets evenly apart on a foil-lined sheet pan. In a small bowl, whisk together garlic, gochujang, doenjang, sugar and 2 teaspoons water. Rub the mixture all over the salmon. (If using skin-on fish, place it skin-side up.)",
      "Roast until the flesh is firm and cooked through, but the middle is still tender, 12 to 15 minutes. Remove from the oven and let the salmon rest 5 minutes before serving."
    ]
  },
  {
    "name": "Olive Oil Baked Salmon",
    "url": "https://cooking.nytimes.com/recipes/1023979-olive-oil-baked-salmon",
    "image": "https://static01.nyt.com/images/2023/03/02/multimedia/as-baked-salmon-wlkf/as-baked-salmon-wlkf-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "¼ cup extra-virgin olive oil",
      "4 (6-ounce) salmon fillets or 1 (1 ½-pound) salmon fillet (skin-on or skinless), patted dry",
      "Salt and pepper",
      "2 lemons",
      "Optional flavorings: rosemary, thyme or oregano sprigs; smashed garlic; fresh or dried chile; olives; anchovies; bay leaves; crushed fennel or coriander seeds"
    ],
    "full_instructions": [
      "Heat the oven to 350 degrees. Drizzle the oil in a baking dish that will fit the salmon. Place the salmon in the dish, skin-side down if applicable. Season with salt and pepper.",
      "Using a vegetable peeler, peel thick strips of zest from 1 lemon, then add to the baking dish. Juice 3 tablespoons of the lemon and pour over the salmon. Nestle in the optional flavorings if using. Bake, basting halfway through with the lemon oil, until just cooked through, 13 to 20 minutes, depending on the size of the fillets. (You will know if the salmon is done when the fish flakes when cut into with a knife or fork or when an instant-read thermometer inserted into the thickest part reaches 120 degrees.)",
      "Transfer the salmon to plates to rest at least 5 minutes; discard the skin if applicable. Remove and discard the lemon peels and any aromatics you don’t want to eat, like herb sprigs. Squeeze about 1 tablespoon of the reserved lemon juice into the baking dish until the sauce is tangy but not puckery. Season to taste with salt and pepper. Eat the salmon with a spoonful of the lemon sauce."
    ]
  },
  {
    "name": "Sheet-Pan Chile Crisp Salmon and Asparagus",
    "url": "https://cooking.nytimes.com/recipes/1024004-sheet-pan-chile-crisp-salmon-and-asparagus",
    "image": "https://static01.nyt.com/images/2023/04/27/multimedia/yf-chile-crisp-salmon-pbwv/yf-chile-crisp-salmon-pbwv-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "1 tablespoon store-bought or homemade chile crisp, plus more for serving",
      "1 tablespoon soy sauce",
      "1 teaspoon honey",
      "2 pounds skinless, center-cut salmon (1 to 1 ½-inch thick), cut into 1 to 1½-inch cubes",
      "1 bunch scallions, light green and white parts thinly sliced (dark greens reserved for another use)",
      "1 bunch asparagus, trimmed",
      "Kosher salt",
      "2 tablespoons olive oil",
      "Cooked grains or salad greens (optional), for serving"
    ],
    "full_instructions": [
      "Heat the oven to 400 degrees. In a large bowl, combine the chile crisp, soy sauce and honey. Add the salmon and sliced scallions; toss to coat.",
      "Add the asparagus to a sheet pan; season with salt and toss with the olive oil until shiny. Add the salmon mixture to the pan, nestling the salmon between spears or on top, if needed. Place any larger cubes near the edges of the pan, so they’ll cook evenly.",
      "Roast in the oven until the salmon is just cooked through and the asparagus crisp-tender, about 12 minutes. Season to taste with salt. Serve with cooked grains or salad greens, if desired."
    ]
  },
  {
    "name": "Salmon and Daikon in Garlic Butter Miso Sauce",
    "url": "https://cooking.nytimes.com/recipes/1023836-salmon-and-daikon-in-garlic-butter-miso-sauce",
    "image": "https://static01.nyt.com/images/2023/01/18/multimedia/ntm-salmon-and-daikon-qchm/ntm-salmon-and-daikon-qchm-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "¼ cup miso",
      "2 tablespoons sake",
      "1 tablespoon mirin",
      "1 teaspoon sea salt",
      "1 pound salmon fillet, skin removed, cut into 6 to 8 pieces",
      "½ pound daikon, halved lengthwise if thick, then cut crosswise into ⅛-inch-thick slices",
      "1¼ cups dashi, preferably kombu and bonito dashi",
      "1 (7-ounce) package enoki mushrooms, trimmed then torn into small clusters (about 5 ounces)",
      "1 small carrot, peeled, cut into 2-inch segments then sliced into ⅛-inch-thick matchsticks",
      "2 garlic cloves, thinly sliced",
      "1 tablespoon unsalted butter, cut into 6 to 8 pieces and chilled",
      "Fresh or bottled yuzu juice (or Meyer lemon juice), to taste (optional)",
      "Chopped dill, for serving (optional)",
      "Shichimi togarashi (Japanese seven-spice powder), for serving",
      "Freshly cooked rice, for serving"
    ],
    "full_instructions": [
      "Make the miso sauce: In a small bowl, whisk together the miso, sake and mirin; set aside.",
      "Prepare the salmon: Sprinkle the salt on both sides of the salmon. Set aside for 15 to 30 minutes, then pat dry using paper towels.",
      "Arrange the daikon slices in an even layer to cover the bottom of a large donabe or Dutch oven. Add the dashi, cover with a lid and set over medium-high heat.",
      "As soon as the dashi starts to boil, add the enoki mushrooms and carrot in layers. Add the salmon pieces, then pour the miso sauce over the salmon. Sprinkle the garlic on top, followed by the butter.",
      "Cover with the lid again, turn down the heat to maintain a simmer, and cook for about 4 minutes, until the salmon is cooked through.",
      "Drizzle the yuzu juice over the salmon, if using. Divide among individual bowls and garnish with chopped dill (if using) and shichimi togarashi. Serve with rice."
    ]
  },
  {
    "name": "One-Pan Salmon Niçoise With Orzo",
    "url": "https://cooking.nytimes.com/recipes/1023943-one-pan-salmon-nicoise-with-orzo",
    "image": "https://static01.nyt.com/images/2023/02/15/multimedia/as-salmon-nicoise-blhk/as-salmon-nicoise-blhk-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "1 large shallot, coarsely chopped",
      "2 tablespoons extra-virgin olive oil",
      "1 cup orzo",
      "Kosher salt (such as Diamond Crystal) and pepper",
      "½ cup pitted kalamata olives",
      "1 pint cherry or other small tomatoes, halved (8 to 10 ounces)",
      "2 tablespoons red wine vinegar",
      "1 tablespoon Dijon mustard",
      "Handful of basil leaves or pinch of thyme leaves (optional)",
      "4 (4- to 5-ounce) salmon fillets, skin on or off",
      "8 ounces green beans, trimmed and cut into 1-inch lengths"
    ],
    "full_instructions": [
      "Transfer 1 tablespoon of the chopped shallot to a medium bowl, then add the remaining shallot to a large (12-inch) skillet. Add 1 tablespoon oil to the skillet and heat over medium high. When the oil is sizzling, add the orzo, season with ½ teaspoon each salt and pepper, and stir constantly until light golden, 2 to 4 minutes.",
      "Add the olives plus 2¼ cups water; bring to a boil, then cover the skillet with a lid, baking sheet or foil. Reduce heat to medium-low and cook according to package directions until the orzo is al dente.",
      "Meanwhile, add the tomatoes, red wine vinegar, mustard, herbs (if using) and the remaining 1 tablespoon oil to the reserved shallots in the bowl; season to taste with salt and pepper then set aside. Season the salmon with salt and pepper.",
      "When the orzo is al dente, add the green beans and stir to combine. If orzo looks dry, add ¼ cup water; you want it to be wet but not soupy. Nestle the salmon in a single layer into the orzo, skin-side up if applicable. Cover and cook until the salmon and orzo are cooked through, 6 to 8 minutes. Remove from heat and let sit, covered, for 2 minutes. If your salmon has skin, peel it off and discard. Top the orzo and salmon with the tomatoes and vinaigrette."
    ]
  },
  {
    "name": "One-Pot Pasta With Ricotta and Lemon",
    "url": "https://cooking.nytimes.com/recipes/1020290-one-pot-pasta-with-ricotta-and-lemon",
    "image": "https://static01.nyt.com/images/2020/12/20/autossell/OnePot-Pasta-textless/OnePot-Pasta-textless-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "Kosher salt",
      "1 pound short, ribbed pasta, like gemelli or penne",
      "1 cup whole-milk ricotta (8 ounces)",
      "1 cup freshly grated Parmesan or pecorino (2 ounces), plus more for serving",
      "1 tablespoon freshly grated lemon zest plus ¼ cup lemon juice (from 1 to 2 lemons)",
      "Black pepper",
      "Red-pepper flakes, for serving",
      "¼ cup thinly sliced or torn basil leaves, for serving (optional)"
    ],
    "full_instructions": [
      "Bring a large pot of salted water to a boil. Add the pasta and cook according to package instructions until al dente. Reserve 1 cup pasta cooking water, then drain the pasta.",
      "In the same pot, make the sauce: Add the ricotta, Parmesan, lemon zest and juice, ½ teaspoon salt and ½ teaspoon pepper and stir until well combined.",
      "Add ½ cup pasta water to the sauce and stir until smooth. Add the pasta and continue to stir vigorously until the noodles are well coated. Add more pasta water as needed for a smooth sauce.",
      "Divide the pasta among bowls and top with some of the sauce that’s pooled at the bottom of the pot. Garnish with grated Parmesan, black pepper, red-pepper flakes and basil, if using."
    ]
  },
  {
    "name": "Gochujang Buttered Noodles",
    "url": "https://cooking.nytimes.com/recipes/1024066-gochujang-buttered-noodles",
    "image": "https://static01.nyt.com/images/2023/03/31/multimedia/31-GOCHUJANGREX1-gochujang-buttered-noodles-zqlg/31-GOCHUJANGREX1-gochujang-buttered-noodles-zqlg-articleLarge-v2.jpg?w=1280&q=75",
    "ingredients": [
      "1 pound spaghetti or other long pasta",
      "6 tablespoons unsalted butter",
      "12 garlic cloves, finely chopped (about ⅓ cup)",
      "Kosher salt and black pepper",
      "¼ cup gochujang paste (not sauce; see Tip)",
      "¼ cup honey",
      "¼ cup sherry vinegar or rice vinegar",
      "Finely chopped cilantro or thinly sliced scallions (optional)"
    ],
    "full_instructions": [
      "Bring a large pot of water to a boil. Add the spaghetti and cook according to package instructions. Reserve 1 cup of the cooking water. Drain the spaghetti and return to its pot.",
      "While the pasta cooks, melt 4 tablespoons of the butter in a skillet over medium-low. Add the garlic and season generously with salt. Cook, stirring occasionally, until the garlic starts to soften but not brown, 1 to 3 minutes.",
      "Stir in the gochujang, honey and vinegar, and bring to a simmer over medium-high. Cook, stirring constantly, until the mixture reduces significantly, 3 to 4 minutes; when you drag a spatula across the bottom of the pan, it should leave behind a trail that stays put for about 3 seconds. Remove from the heat.",
      "Transfer the sauce to the pot with the spaghetti and add the remaining 2 tablespoons butter. Vigorously stir until the butter melts. Add splashes of the pasta cooking water, as needed, to thin out the sauce. Taste and season with salt and pepper. Top with the cilantro or scallions (if using) and serve immediately."
    ]
  },
  {
    "name": "Edamame Pesto Pasta",
    "url": "https://cooking.nytimes.com/recipes/1024168-edamame-pesto-pasta",
    "image": "https://static01.nyt.com/images/2023/05/10/multimedia/hm-pasta-with-edamame-pesto-gmwf/hm-pasta-with-edamame-pesto-gmwf-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "Kosher salt (such as Diamond Crystal) and black pepper",
      "1 (12-ounce) package frozen shelled edamame",
      "1 pound short pasta, such as fusilli, rigatoni or cavatappi",
      "4 garlic cloves, peeled and roughly chopped",
      "1½ packed cups soft herbs such as basil, parsley or mint leaves (or a combination), plus more to serve",
      "⅓ cup roasted unsalted sunflower or pumpkin seeds",
      "½ cup extra virgin olive oil, plus more for serving",
      "3 to 4 tablespoons lemon juice (from 1 to 2 lemons), plus more for serving",
      "3 tablespoons nutritional yeast (or grated hard cheese like pecorino or Parmesan)",
      "Red-pepper flakes, to serve"
    ],
    "full_instructions": [
      "Bring a large pot of salted water to a boil. Add the edamame and cook for 3 to 4 minutes, until just tender. Using a slotted spoon or ladle, remove the edamame and place in a colander. Rinse under cold water, then allow to drain and cool.",
      "To the same water (top it up with hot tap water if needed), add the pasta. Cook according to package instructions.",
      "Meanwhile, to a food processor or high-speed blender, add the cooled edamame, garlic, herbs and seeds and blitz for 8 to 10 seconds until the mixture resembles coarse crumbs. With the motor running, trickle in the olive oil and 2 to 3 tablespoons of water, and blitz until it resembles a thick paste. (It doesn’t need to be smooth, some texture is preferred.) Stir in 3 tablespoons lemon juice, nutritional yeast, 1 teaspoon of salt and a few pinches of black pepper. Taste and adjust salt and lemon juice until you are happy with the balance.",
      "When the pasta is ready, reserve 2 cups of the cooking water and drain the pasta. Place the pot back on medium heat and add the edamame pesto, along with 1 cup of pasta cooking water. Stir until the pesto and water has emulsified, then add the pasta and stir to coat. If it looks dry, add just enough pasta cooking water for the sauce to look loose.",
      "To serve, finish with a drizzle of olive oil, a squeeze of lemon juice, a scatter of red-pepper flakes and a few torn herbs."
    ]
  },
  {
    "name": "Roasted White Bean and Tomato Pasta",
    "url": "https://cooking.nytimes.com/recipes/1024062-roasted-white-bean-and-tomato-pasta",
    "image": "https://static01.nyt.com/images/2023/03/22/multimedia/aw-roasted-white-bean-and-tomato-pasta-wjzp/aw-roasted-white-bean-and-tomato-pasta-wjzp-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "Salt and black pepper",
      "¾ cup plus 2 tablespoons extra-virgin olive oil",
      "1 large shallot, finely minced",
      "2 tablespoons tomato paste",
      "5 garlic cloves, thinly sliced",
      "½ teaspoon finely chopped fresh rosemary (or ¼ teaspoon dried)",
      "½ teaspoon red-pepper flakes",
      "½ teaspoon granulated sugar",
      "16 ounces cherry tomatoes, halved",
      "1 (15-ounce) can small white beans (preferably navy or cannellini beans), rinsed (or 1⅓ cups cooked white beans)",
      "1 pound orecchiette (or other shaped pasta that will cup or grasp the sauce)",
      "Freshly grated Parmesan or pecorino (optional), for serving"
    ],
    "full_instructions": [
      "Heat the oven to 375 degrees. Bring a large pot of salted water to a boil over high.",
      "In a small bowl, stir together ¼ cup olive oil with the shallot, tomato paste, garlic, rosemary, red-pepper flakes and sugar. On a large baking sheet, toss the tomatoes with the dressing; season generously with salt and pepper, then spread in an even layer.",
      "On a second baking sheet, toss the beans with 2 tablespoons olive oil; season generously with salt and pepper.",
      "Roast the tomatoes and beans, stirring halfway through, until tomatoes slump and beans crisp, about 25 minutes.",
      "While the tomatoes and beans roast, cook the pasta until al dente. Reserve 1 cup pasta cooking water then drain pasta.",
      "Transfer the beans and tomatoes to the pot. Add ¼ cup pasta cooking water to the sheet pan from the tomatoes and use a flexible spatula to scrape the browned bits from the bottom of the sheet pan; transfer to the pot, then repeat with another ¼ cup pasta cooking water. (One thing they’ll teach you in French culinary school: Never, ever discard the sucs, those browned bits at the bottom of the pan that carry deep flavor.)",
      "Add the pasta and the remaining ½ cup olive oil to the pot; stir vigorously until saucy. Season generously with salt and pepper, then add extra pasta water as needed to moisten until glossy. Divide among wide, shallow bowls and top with grated cheese, if desired."
    ]
  },
  {
    "name": "Pasta al Pomodoro",
    "url": "https://cooking.nytimes.com/recipes/1023408-pasta-al-pomodoro",
    "image": "https://static01.nyt.com/images/2022/08/21/dining/21EAT-EK-pasta-al-pomodoro/merlin_211545387_5042dbc4-2fa7-4ec9-b10e-b39ccd0ed5fa-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "½ cup extra-virgin olive oil",
      "4 large garlic cloves, lightly crushed and peeled",
      "3 pounds ripe tomatoes (any mix of plum, grape, cherry and Campari), coarsely chopped",
      "Salt",
      "1 pound thin spaghetti"
    ],
    "full_instructions": [
      "Add the olive oil and garlic to a large Dutch oven or high-sided skillet. Turn the heat to medium-high and cook the garlic, stirring occasionally, until fragrant and lightly golden, and small rapid bubbles form around the cloves, 1 to 3 minutes. Remove the garlic from the pot and discard (or eat).",
      "Carefully and gently lower the chopped tomatoes into the hot oil and cook, stirring constantly, until the tomatoes let off some liquid and the sauce starts to bubble steadily. Season generously with salt. Lower the heat to medium and simmer, stirring occasionally, until the tomatoes break down and the sauce reduces significantly, about 40 minutes.",
      "Set a metal sieve, strainer or food mill over a medium bowl. Carefully pour in the tomato sauce. If using a sieve or strainer, push the sauce through with a spoon or flexible spatula, until all that remains are seeds and skins. Be sure to repeatedly scrape off the valuable pulp collecting on the bottom of the sieve (by holding the sieve down against the edge of the bowl and pulling it back). You should have about 2 cups of sauce in the bowl. Taste and add more salt, if needed, then return the sauce to the Dutch oven.",
      "Meanwhile, cook the spaghetti in a large pot of salted boiling water until al dente. Drain the pasta and add to the sauce.",
      "Turn the heat to high and cook, stirring constantly, until the sauce reduces slightly and the pasta is well coated but not drowned in the sauce, about 2 minutes. Remove the pot from the heat and let it sit so the pasta can absorb the sauce further, about 5 more minutes. Serve immediately."
    ]
  },
  {
    "name": "Buttery Lemon Pasta With Almonds and Arugula",
    "url": "https://cooking.nytimes.com/recipes/1023797-buttery-lemon-pasta-with-almonds-and-arugula",
    "image": "https://static01.nyt.com/images/2023/01/11/multimedia/05Apperex-pasta-1-2f99/05Apperex-pasta-1-2f99-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "Fine salt and freshly ground black pepper",
      "1 pound linguine or spaghetti",
      "6 tablespoons unsalted butter",
      "1 cup sliced almonds",
      "2 fresh rosemary sprigs",
      "¼ teaspoon red-pepper flakes, plus more to taste",
      "¼ cup freshly squeezed lemon juice, plus more to taste",
      "1 tablespoon finely grated lemon zest",
      "4 to 5 ounces baby or wild arugula, coarsely chopped, or use baby kale or spinach (4 to 5 cups)",
      "Grated Parmesan, for serving"
    ],
    "full_instructions": [
      "Bring a large pot of heavily salted water to a boil. Add pasta and cook until it is 1 minute shy of being al dente, usually a minute or 2 less than the package instructions. Scoop out about 1½ cups pasta water, then drain pasta.",
      "While the pasta cooks, in a large skillet or Dutch oven, melt butter over medium heat. Cook, swirling occasionally, until the foam subsides, the milk solids turn golden-brown and the butter smells nutty and toasty, 3 to 4 minutes. (Watch carefully to see that it doesn’t burn.)",
      "Stir in almonds, rosemary and red-pepper flakes, and cook, stirring occasionally, until the nuts are toasted and slightly darker in color, about 1 minute.",
      "Add about 1 cup pasta water to the skillet and bring to a simmer. Add lemon juice, zest, ½ teaspoon salt and a large pinch of black pepper, then add drained pasta and toss well. Add arugula, tossing until it wilts. Simmer for another minute, if needed, to thicken the sauce until it’s thick and glossy. If the mixture seems dry, add more pasta water 1 tablespoon at a time.",
      "Taste and add more salt, red-pepper flakes and lemon juice, if needed. Serve topped with grated Parmesan and more red-pepper flakes, if you like."
    ]
  },
  {
    "name": "Kale Sauce Pasta",
    "url": "https://cooking.nytimes.com/recipes/1019134-kale-sauce-pasta",
    "image": "https://static01.nyt.com/images/2020/05/31/magazine/07mag-eat1/07mag-07eat-t_CA0-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "Kosher salt (such as Diamond Crystal)",
      "¼ cup extra-virgin olive oil, plus more for serving",
      "2 garlic cloves, smashed flat and peeled",
      "1 pound lacinato kale, thick ribs removed",
      "Freshly ground black pepper",
      "½ pound pasta, like pappardelle or rigatoni",
      "¾ cup coarsely grated Parmigiano- Reggiano"
    ],
    "full_instructions": [
      "Put a large pot of generously salted water over high heat, and bring to a boil. In a small skillet over medium heat, add olive oil and garlic, and cook until the garlic begins to sizzle. Reduce heat to low, and cook very gently until garlic is soft and begins to turn light gold, about 5 minutes. Remove from heat.",
      "When water is boiling, add kale leaves, and cook until tender, but not mushy, about 5 minutes. Pull out the hot, dripping kale leaves with tongs, and put directly into a blender. (Don’t drain the pot; you’ll use that same boiling water to cook the pasta.) Add garlic and its oil to the blender, along with a splash of hot water from the pot if you need some more liquid to get the blender going. Blend into a fine, thick green purée. Taste, and adjust seasoning with salt and pepper, then blend again.",
      "Add the pasta to the still-boiling water, and cook according to directions on the package. Ladle out about a cup of the water to save for finishing the dish, then drain the pasta and return it to the dry pot. Add the kale purée, about ¾ of the grated cheese and a splash of the reserved pasta water. Toss until all the pasta is well coated and bright green, adding another splash of pasta water if needed so that the sauce is loose and almost creamy in texture. Serve in bowls right away, and top with an extra drizzle of olive oil and the rest of the grated cheese."
    ]
  },
  {
    "name": "Pasta With Butternut Squash, Kale and Brown Butter",
    "url": "https://cooking.nytimes.com/recipes/1023461-pasta-with-butternut-squash-kale-and-brown-butter",
    "image": "https://static01.nyt.com/images/2022/09/13/dining/as-Pasta-With-Butternut-Squash-Kale-and-Brown-Butter/merlin_212616150_ff3fcbc7-ff4a-4866-bbce-c3d9c4e1c0fd-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "Kosher salt (such as Diamond Crystal)",
      "1 tablespoon neutral oil, such as canola or grapeseed oil",
      "1 to 1½ pounds butternut, honeynut, acorn or delicata squash, peeled if desired, halved, seeded and sliced ¼-inch-thick crosswise",
      "1 pound whole-wheat spaghetti or linguine",
      "1 bunch Tuscan kale, ribs removed, leaves torn or coarsely chopped",
      "6 tablespoons unsalted butter, sliced",
      "1¼ teaspoons garam masala",
      "½ teaspoon red-pepper flakes, plus more as needed",
      "1 teaspoon finely grated lemon zest plus 2 tablespoons juice (from 1 lemon), plus more juice as needed",
      "Grated Parmesan, for serving"
    ],
    "full_instructions": [
      "Bring a large pot of salted water to a boil. Meanwhile, in a large Dutch oven or skillet, heat half the oil over medium-high. Add half the squash in a single layer, season with salt and cook, undisturbed, until browned underneath, 3 to 5 minutes. Scoot the squash to the side of the pot, piling it up as needed to make room, then add the remaining oil. Arrange the remaining squash in a single layer, season with salt and cook until browned, 3 to 5 minutes. (If there’s not enough room for the second batch, remove the browned squash to a plate while you cook the rest.)",
      "When the water comes to a boil, add the pasta and cook according to package directions until al dente. During the last 3 minutes of the cooking, add the kale. Reserve 1 cup of the pasta water, then drain the pasta.",
      "When all the squash is browned, return all the squash to the pot, if you set any aside while cooking the second batch. Reduce the heat to medium-low, add the butter and stir with the squash until the butter is golden, nutty smelling and foaming, 1 to 4 minutes. (If you’re using a dark pot, it can be hard to tell if the butter’s browned, so spoon some of the butter on the squash to see if the butter’s speckled brown.) Turn off the heat, add the garam masala and red-pepper flakes, and stir until fragrant, about 1 minute. Add 1 tablespoon of cold water (or an ice cube) and toss gently to stop the cooking, then set aside until the pasta is ready.",
      "Add the pasta and ½ cup pasta water to the squash mixture. Set over low heat and toss gently until the pasta is glossed with sauce. (Some squash pieces might break apart, which can be a good thing: better disbursement through the pasta.) If the pasta looks dry, add more pasta water as needed. Remove from heat and stir in the lemon zest and juice. Season to taste with more lemon juice, red-pepper flakes and salt. Top servings with grated Parmesan."
    ]
  },
  {
    "name": "Pasta Marinara With 40 Cloves of Garlic",
    "url": "https://cooking.nytimes.com/recipes/1023660-pasta-marinara-with-40-cloves-of-garlic",
    "image": "https://static01.nyt.com/images/2022/11/14/dining/as-pasta-marinara-with-40-cloves-of-garlic/merlin_216141120_b03b0024-0e6c-4dba-a82c-72c3ef00fa78-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "¼ cup extra-virgin olive oil",
      "40 garlic cloves, peeled",
      "Salt",
      "1 pound rigatoni or other tubular pasta",
      "1 (28-ounce) can crushed tomatoes or whole peeled tomatoes",
      "½ teaspoon red-pepper flakes"
    ],
    "full_instructions": [
      "In a large Dutch oven, heat the oil and garlic over medium. When the garlic is sizzling, stir occasionally until the garlic turns light golden and begins to stick to the bottom of the pot, 3 to 5 minutes.",
      "Season with salt, reduce heat to low, cover the pot, and cook, stirring occasionally, until the garlic is soft, 13 to 15 minutes. Meanwhile, bring a large pot of salted water to a boil. Add the pasta to the boiling water and cook until al dente. Reserve ½ cup pasta water, then drain.",
      "If using whole peeled tomatoes, break up the tomatoes with scissors or hands. Add the canned tomatoes and their liquid, as well as the red-pepper flakes, to the garlic, and season with salt. Increase heat to medium-high, partially cover the pot and cook until thickened and flavorful, 5 to 7 minutes.",
      "Add the pasta to the sauce and stir vigorously until the sauce coats the noodles, 1 to 2 minutes. Add pasta water as needed to loosen the sauce and help it cling to the noodles, and serve."
    ]
  },
  {
    "name": "Chicken Piccata",
    "url": "https://cooking.nytimes.com/recipes/1019883-chicken-piccata",
    "image": "https://static01.nyt.com/images/2021/02/14/dining/as-chicken-piccata/as-chicken-piccata-articleLarge-v3.jpg?w=1280&q=75",
    "ingredients": [
      "4 boneless, skinless chicken breasts (about 1½ pounds), halved horizontally (see tip)",
      "Kosher salt and black pepper",
      "All-purpose flour, for dredging",
      "6 tablespoons unsalted butter",
      "3 tablespoons extra-virgin olive oil, plus more as needed",
      "1 shallot, peeled and sliced lengthwise",
      "1 lemon, halved (half thinly sliced and seeds removed; half juiced, about 2 tablespoons)",
      "¾ cup chicken stock",
      "4 teaspoons drained capers",
      "Coarsely chopped fresh parsley, for garnish (optional)"
    ],
    "full_instructions": [
      "Season both sides of the chicken with salt and pepper. Dredge the chicken in flour and shake off any excess.",
      "In a large skillet, heat 3 tablespoons butter and the olive oil over medium-high heat until the butter has melted. Working in batches to avoid crowding the pan, add the chicken and sauté until golden brown and cooked through, about 3 minutes per side.",
      "Remove the chicken, place on a plate and repeat with the remaining pieces, adding more olive oil if needed.",
      "Once the chicken is cooked, add the shallot and lemon slices to the pan and sauté, stirring occasionally, until lightly caramelized and fragrant, 2 to 3 minutes. Add the stock and simmer until reduced by half, about 3 minutes.",
      "Reduce the heat to low, then stir in the remaining 3 tablespoons butter, capers and lemon juice, to taste. Season with salt and pepper to taste. Serve the chicken with the sauce poured over the top. Garnish with parsley if desired."
    ]
  },
  {
    "name": "Chicken Manchurian",
    "url": "https://cooking.nytimes.com/recipes/1023892-chicken-manchurian",
    "image": "https://static01.nyt.com/images/2023/03/10/multimedia/zs-chicken-manchurian-hqkz/zs-chicken-manchurian-hqkz-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "1 egg",
      "4 tablespoons plus 1 teaspoon cornstarch",
      "1 teaspoon garlic paste or freshly grated garlic",
      "1 teaspoon black pepper",
      "Fine sea salt",
      "1½ pounds boneless, skinless chicken breast, cut into ¾-inch cubes",
      "⅓ cup vegetable oil",
      "3 whole dried dundicut chiles or bird’s-eye chiles",
      "½ cup ketchup",
      "¼ cup chile-garlic sauce",
      "2 tablespoons light soy sauce (or regular soy sauce)",
      "1 cup chicken stock (optional)",
      "1 bell pepper, halved, seeded and cut into ¾-inch pieces",
      "3 spring onions or 1 medium scallion, trimmed and thinly sliced",
      "Cooked white rice or fried rice, for serving"
    ],
    "full_instructions": [
      "Velvet the chicken: In a medium bowl, whisk the egg. Continue whisking and gradually add 4 tablespoons of cornstarch until there are no lumps. Stir in garlic, black pepper and ½ teaspoon salt. Add the chicken pieces and stir until well coated. Cover and set aside for 30 minutes.",
      "In a large wok or deep, high-sided skillet, heat oil on medium for 45 seconds. Add chicken (in batches, if necessary to avoid crowding) and cook until it starts turning white, 1 to 2 minutes. Flip the pieces and continue cooking until the chicken starts to turn golden, 2 to 3 minutes. Using a slotted spoon, remove chicken and set aside.",
      "Add dried chiles and cook on medium for about 1 minute, stirring occasionally.",
      "Meanwhile, in a small bowl, stir together ketchup, chile-garlic sauce, soy sauce, ½ teaspoon salt and, if using, chicken stock (if not using chicken stock, stir in 1 cup water). Add to mixture in pan along with bell pepper and stir to combine.",
      "Separately, mix the remaining 1 teaspoon cornstarch with ¼ cup water until smooth. Stir it into the wok and simmer until the sauce thickens and starts to turn glossy, 3 to 4 minutes. Add chicken and stir to combine. Top with spring onions. Serve with rice."
    ]
  },
  {
    "name": "Miso-Honey Chicken and Asparagus",
    "url": "https://cooking.nytimes.com/recipes/1023863-miso-honey-chicken-and-asparagus",
    "image": "https://static01.nyt.com/images/2023/04/11/multimedia/ya-miso-honey-chicken-and-asparagus-mwfj/ya-miso-honey-chicken-and-asparagus-mwfj-articleLarge-v2.jpg?w=1280&q=75",
    "ingredients": [
      "3 tablespoons white miso",
      "3 tablespoons mild honey",
      "3 tablespoons soy sauce or tamari",
      "1 tablespoon rice vinegar",
      "2 teaspoons finely grated fresh ginger",
      "2 teaspoons finely grated garlic",
      "2 teaspoons chile-garlic sauce or other hot sauce",
      "1 tablespoon plus 2 teaspoons neutral oil",
      "1½ to 2 pounds boneless, skinless chicken thighs",
      "1 large bunch asparagus (about 1 pound), trimmed",
      "Salt and pepper",
      "2 scallions, thinly sliced",
      "Cooked rice (optional), for serving"
    ],
    "full_instructions": [
      "Make the marinade: In a bowl, whisk together the miso, honey, soy sauce, rice vinegar, ginger, garlic, chile-garlic sauce, 1 tablespoon oil and 1 tablespoon water. Refrigerate half the marinade for serving.",
      "Place the chicken in a shallow dish or zip-top bag and pour the remaining marinade over the top. Toss the chicken until coated and let marinate in the refrigerator for up to 30 minutes. (A longer marinade may dry out the chicken.)",
      "When you are ready to cook, heat the broiler with a rack set 6 inches below it. Line a large baking sheet with aluminum foil.",
      "Remove the chicken from the marinade, scraping off and discarding any excess. Place the chicken in a single layer on one side of the baking sheet, with the flatter side up. Place the asparagus on the other side. Drizzle the asparagus with remaining oil, then season the asparagus; toss to coat.",
      "Broil until the chicken is cooked through with some charred spots and the asparagus is browned, about 10 minutes.",
      "To serve, top the chicken with a drizzle of the reserved marinade and a sprinkle of scallions. Serve with rice, if desired."
    ]
  },
  {
    "name": "Oven BBQ Chicken",
    "url": "https://cooking.nytimes.com/recipes/1024374-oven-bbq-chicken",
    "image": "https://static01.nyt.com/images/2023/07/14/multimedia/as-oven-bbq-chicken-zpjc/as-oven-bbq-chicken-zpjc-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "1 (18-ounce) jar barbecue sauce, or 2 cups homemade barbecue sauce",
      "About 3 pounds bone-in, skin-on chicken leg quarters or thighs, patted dry",
      "1 tablespoon neutral oil (such as grapeseed)",
      "2 teaspoons store-bought or homemade chili powder",
      "1 teaspoon smoked paprika",
      "Kosher salt (such as Diamond Crystal)",
      "1 teaspoon apple cider vinegar"
    ],
    "full_instructions": [
      "Heat the oven to 425 degrees. Pour the barbecue sauce into a 9-by-13-inch baking pan or dish, or a large skillet, or another ovenproof vessel that fits the chicken snugly, then shake so the sauce disperses into an even layer.",
      "In a large bowl, toss the chicken with the oil, chili powder, paprika and 1 teaspoon salt until coated. Arrange the chicken, skin side up, on top of the barbecue sauce. Roast until the chicken skin is crisp, 30 to 35 minutes.",
      "Scrape the sides of the pan and stir the barbecue sauce to incorporate the caramelized bits into the sauce. Turn the chicken to coat in the sauce, arrange skin-side-up, then spoon sauce on top of the chicken. Roast until the chicken is sticky and charred in spots, 10 to 15 minutes more.",
      "Transfer chicken to plates. Stir the apple cider vinegar into the sauce remaining in the pan. Serve the chicken with the extra sauce."
    ]
  },
  {
    "name": "Spicy Honey Chicken With Broccoli",
    "url": "https://cooking.nytimes.com/recipes/1024005-spicy-honey-chicken-with-broccoli",
    "image": "https://static01.nyt.com/images/2023/04/25/multimedia/yf-spicy-skillet-honey-chicken-cjvt/yf-spicy-skillet-honey-chicken-cjvt-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "2 tablespoons olive oil",
      "1 tablespoon honey",
      "2 heaping tablespoons jarred pickled jalapeños, plus 1 to 2 tablespoons of the pickling liquid",
      "1½ pounds boneless, skinless chicken thighs, cut into 1- to 1½-inch pieces",
      "Kosher salt",
      "1 small head broccoli, florets cut into bite-size pieces (3 to 4 cups)",
      "½ cup crumbled feta"
    ],
    "full_instructions": [
      "In a large bowl, mix together the olive oil, honey and 1 tablespoon pickling liquid. Season the chicken lightly all over with salt, then add to the mixture, tossing to coat.",
      "Heat a (dry) 12-inch cast-iron or heavy skillet with a tight-fitting lid over medium-high until hot, about 2 minutes. Add the chicken in an even layer and let cook, undisturbed, until the bottoms are golden brown and easily release from the pan, about 7 minutes.",
      "Use tongs to flip the chicken; let cook, undisturbed, until the chicken has no pink spots on the outside, 2 to 3 minutes more, reducing the heat as necessary to keep it from scorching.",
      "Push the chicken to the sides of the pan, then add the broccoli to the center. Season the broccoli lightly with salt, cover the skillet and cook until the chicken cooks through, about 2 minutes. Stir to combine, scraping up anything on the bottom of the pan, and cook uncovered, until the broccoli is crisp-tender or to your liking, 1 to 2 minutes more.",
      "Off heat, mix in half the feta and jalapeños, scraping up anything on the bottom. If the pan looks dry, then add 1 tablespoon of pickling liquid (or water, if sensitive to heat). Top with the remaining feta and jalapeños."
    ]
  },
  {
    "name": "Sheet-Pan Roast Chicken With Tangy Greens",
    "url": "https://cooking.nytimes.com/recipes/1024205-sheet-pan-roast-chicken-with-tangy-greens",
    "image": "https://static01.nyt.com/images/2023/05/16/multimedia/sc-sheet-pan-chicken-thighs-fpqh/sc-sheet-pan-chicken-thighs-fpqh-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "3 tablespoons extra-virgin olive oil, plus for drizzling",
      "6 garlic cloves",
      "1½ tablespoons curry powder",
      "2 teaspoons kosher salt, plus more for finishing",
      "1 teaspoon black pepper",
      "¼ teaspoon red-pepper flakes",
      "4 bone-in, skin-on chicken leg quarters (2½ to 3 pounds)",
      "10 ounces chopped fresh kale leaves or other braising greens (about 6 packed cups)",
      "½ cup pitted or unpitted green olives (optional)",
      "2 tablespoons bread-and-butter pickle brine or apple cider vinegar"
    ],
    "full_instructions": [
      "Heat the oven to 425 degrees and line a large baking sheet with parchment paper.",
      "In a large bowl or heavy-duty resealable plastic bag, combine 3 tablespoons olive oil with the garlic, curry powder, salt, pepper and red-pepper flakes. Add chicken and toss well to coat. (If time allows, you can refrigerate the chicken in the marinade overnight, for deeper flavor.) Add one more tablespoon of oil if the chicken is lean or on the small side.",
      "Transfer to the prepared baking sheet, laying the chicken legs skin-side up and scattering the garlic among them. Roast until golden brown and just cooked through, 30 to 40 minutes, turning the pan front to back once about halfway through cooking for even browning. (An instant-read thermometer inserted into the thickest part of the thigh reads 165 degrees.)",
      "Transfer the chicken to a platter or four plates to rest. Add the greens, olives (if using) and brine to the baking sheet; toss to coat in the cooking juices, then roast until wilted, bright green and slightly crispy on some of the edges, 5 minutes. Taste and season with more salt, if needed.",
      "Serve the greens with the chicken, scraping any excess juices from the pan to drizzle over the top."
    ]
  },
  {
    "name": "Roasted Chicken With Fish-Sauce Butter",
    "url": "https://cooking.nytimes.com/recipes/1022086-roasted-chicken-with-fish-sauce-butter",
    "image": "https://static01.nyt.com/images/2022/04/07/autossell/Fish-sauce-chicken-thumb/Fish-sauce-chicken-thumb-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "4 bone-in, skin-on chicken thighs (about 2 pounds)",
      "Kosher salt (such as Diamond Crystal) and black pepper",
      "2 tablespoons olive oil",
      "¾ pound bread, crusts removed, bread torn into bite-size pieces (about 4 cups; see Tip)",
      "1 tablespoon dark brown sugar",
      "1 tablespoon fish sauce",
      "1 tablespoon lemon juice",
      "3 tablespoons cold unsalted butter, kept whole",
      "Cilantro leaves with tender stems, for serving"
    ],
    "full_instructions": [
      "Heat oven to 450 degrees. Pat the chicken dry with paper towels and season lightly with salt and pepper. (The fish-sauce butter is plenty salty, so don’t overdo the salt here.) Arrange the chicken skin-side up on a sheet pan and drizzle the oil over the chicken skin, coating it evenly. Roast until the chicken is light gold and the sheet pan is pooling with hot, rendered chicken fat, about 25 minutes.",
      "Take the sheet pan out of the oven, scatter the bread around the chicken and toss gently to coat in the chicken fat. Place the pan back in the oven and roast until the chicken is golden, crispy and sizzling (you’ll hear it), about 15 minutes.",
      "While the chicken roasts, combine the brown sugar, fish sauce and lemon juice in a small saucepan and bring to a simmer over medium heat. Cook, occasionally swirling the pan or stirring the sauce with a wooden spoon, until bubbling vigorously and the mixture has reduced by about half, 2 to 3 minutes. This part is fun: Turn off the heat and add the butter, constantly swirling the pan or stirring with a wooden spoon, until all of the butter has melted and incorporated into the fish sauce mixture.",
      "To serve, scatter the cilantro all over the chicken and bread and spoon some of the fish-sauce butter over each chicken thigh, reserving some to add to each plate for dipping the chicken and croutons while eating (which is divine)."
    ]
  },
  {
    "name": "Skillet Hot Honey Chicken With Hearty Greens",
    "url": "https://cooking.nytimes.com/recipes/1019790-skillet-hot-honey-chicken-with-hearty-greens",
    "image": "https://static01.nyt.com/images/2021/03/07/dining/as-hot-honey-chicken-thighs/as-hot-honey-chicken-thighs-articleLarge-v2.jpg?w=1280&q=75",
    "ingredients": [
      "2 pounds bone-in, skin-on chicken thighs (4 to 6 thighs)",
      "Kosher salt and pepper",
      "1 tablespoon extra-virgin olive oil",
      "1 small hot chile, thinly sliced (such as jalapeño, Fresno or serrano), or to taste",
      "1 large bunch or head of hearty greens, such as escarole, mustard greens or kale (about 6 ounces)",
      "2 tablespoons honey",
      "1 tablespoon apple cider vinegar"
    ],
    "full_instructions": [
      "Pat the chicken thighs dry with a paper towel, then season both sides with salt and pepper. Drizzle the olive oil into a large skillet, then add the chicken thighs skin side down.",
      "Set over medium heat and cook, without moving them, until the skin is crisp and deep golden brown, about 15 minutes. If you can’t stand leaving the chicken untouched for this long, use your tongs to press the chicken down into the pan, which promotes even browning.",
      "Flip the thighs over and swirl the chile into the rendered chicken fat. Cook until the meat is cooked through, about 10 minutes.",
      "Meanwhile, stem and tear the hearty greens into big bite-size pieces. In a big bowl, toss them with salt and pepper.",
      "Transfer the chicken to serving plates, leaving the fat in the pan. Off the heat, stir the honey and vinegar into the fat until the honey’s melted and everything’s combined. Dress the greens with enough of the sauce to lightly coat, seasoning with salt and pepper as needed. (Feel free to eat the chile peppers or leave them behind.) Serve the chicken with the salad, spooning more sauce over the chicken and salad as desired."
    ]
  },
  {
    "name": "One-Pot Chicken and Rice With Ginger",
    "url": "https://cooking.nytimes.com/recipes/1023346-one-pot-chicken-and-rice-with-ginger",
    "image": "https://static01.nyt.com/images/2022/07/19/dining/nb-one-pot-ginger-chicken-and-rice/nb-one-pot-ginger-chicken-and-rice-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "2 tablespoons neutral or olive oil",
      "1 (3-inch) piece fresh ginger, peeled and cut into thin slices",
      "2 pounds boneless, skinless chicken thighs or breasts",
      "Kosher salt",
      "3 large garlic cloves, minced or grated",
      "2 cups jasmine rice, rinsed with cold water",
      "3 cups low-sodium chicken broth or water, at room temperature",
      "¾ pound quick-cooking greens, such as chard, kale or spinach, leaves removed from thick stems, if needed, and cut or torn into bite-size pieces (about 4 packed cups)",
      "2 tablespoons soy sauce, plus more as needed",
      "2 limes, 1 juiced (about 1 tablespoon juice) and 1 cut into wedges",
      "2 scallions (optional), sliced",
      "¼ packed cup cilantro leaves and tender stems (optional), roughly torn or chopped"
    ],
    "full_instructions": [
      "In a large Dutch oven or pot with a lid, heat the oil and ginger slices over medium-high until the oil around the ginger starts to sizzle, 1 to 2 minutes. Season the chicken with salt, then push the ginger to the side. Add the chicken to the pan and let cook, undisturbed, until the chicken starts to brown and easily releases from the pan, 5 to 7 minutes. (It’s OK if the pieces of chicken don’t all have color, as it will be crowded.) Stir in the garlic and rice, flipping over the chicken, and cook until the rice is coated with oil and starts to sizzle, about 1 minute.",
      "Add the stock or water, then raise the heat to high to bring to a boil, stirring to scrape up anything on the bottom of the pot. Cover and immediately lower the heat to maintain a simmer. Cook until most of the water has been absorbed and the chicken is cooked through, about 20 minutes. During the last 8 minutes, stir to make sure nothing is sticking on the bottom, then layer the greens on top, cover and finish cooking.",
      "Remove from the heat, stir in the soy sauce and juice of 1 lime. Fluff the rice and let sit for 5 minutes, covered. Serve as is, or pull the chicken apart into bite-size pieces. Season to taste with salt, the lime wedges and more soy as needed or serve at the table. Top with the scallions and cilantro, if using."
    ]
  },
  {
    "name": "Spaghetti Carbonara",
    "url": "https://cooking.nytimes.com/recipes/12965-spaghetti-carbonara",
    "image": "https://static01.nyt.com/images/2021/02/14/dining/carbonara-horizontal/carbonara-horizontal-articleLarge-v2.jpg?w=1280&q=75",
    "ingredients": [
      "Salt",
      "2 large eggs and 2 large yolks, room temperature",
      "1 ounce (about ⅓ packed cup) grated pecorino Romano, plus additional for serving",
      "1 ounce (about ⅓ packed cup) grated Parmesan",
      "Coarsely ground black pepper",
      "1 tablespoon olive oil",
      "3½ ounces of slab guanciale (see recipe), pancetta or bacon, sliced into pieces about ¼ inch thick by ⅓ inch square",
      "12 ounces spaghetti (about ¾ box)"
    ],
    "full_instructions": [
      "Place a large pot of lightly salted water (no more than 1 tablespoon salt) over high heat, and bring to a boil. Fill a large bowl with hot water for serving, and set aside.",
      "In a mixing bowl, whisk together the eggs, yolks and pecorino and Parmesan. Season with a pinch of salt and generous black pepper.",
      "Set the water to boil. Meanwhile, heat oil in a large skillet over medium heat, add the pork, and sauté until the fat just renders, on the edge of crispness but not hard. Remove from heat and set aside.",
      "Add pasta to the water and boil until a bit firmer than al dente. Just before pasta is ready, reheat guanciale in skillet, if needed. Reserve 1 cup of pasta water, then drain pasta and add to the skillet over low heat. Stir for a minute or so.",
      "Empty serving bowl of hot water. Dry it and add hot pasta mixture. Stir in cheese mixture, adding some reserved pasta water if needed for creaminess. Serve immediately, dressing it with a bit of additional grated pecorino and pepper."
    ]
  },
  {
    "name": "Basil-Butter Pasta",
    "url": "https://cooking.nytimes.com/recipes/1024372-basil-butter-pasta",
    "image": "https://static01.nyt.com/images/2023/07/13/multimedia/as-basil-butter-pasta-zvgw/as-basil-butter-pasta-zvgw-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "Salt",
      "3 cups packed basil leaves (about 80 grams, from 2 large bunches)",
      "6 tablespoons unsalted butter, sliced, at room temperature",
      "1 pound of any pasta, any type"
    ],
    "full_instructions": [
      "Bring a large pot of well-salted water to a boil. Place the basil in a heatproof colander. Once the water is boiling, submerge the colander with the basil into the pot and use a spoon to push the leaves into the water. Blanch for 10 seconds, then immediately rinse the leaves under cold water to stop the cooking. Squeeze them dry with your hands. Reserve the boiling water.",
      "Transfer the basil to a food processor and pulse until finely chopped. Add the butter and process, scraping the sides of the food processor as needed, until very smooth. Refrigerate until ready to use. (Basil butter will keep, refrigerated, for up to 1 week, or in the freezer for several months.)",
      "Add the pasta to the boiling water and cook until tender. Reserve 1 cup of the pasta cooking water, then drain the pasta. Return the pasta and ¼ cup of the reserved pasta water to the pot, then add the basil butter and toss to coat. (Doesn’t it smell incredible?) If the pasta is dry instead of silky and glossy, add more pasta water, 1 tablespoon at a time. Season to taste with salt."
    ]
  },
  {
    "name": "Ricotta Pasta Alla Vodka",
    "url": "https://cooking.nytimes.com/recipes/1024008-ricotta-pasta-alla-vodka",
    "image": "https://static01.nyt.com/images/2023/03/10/multimedia/EK-ricotta-pasta-alla-vodka-wfkh/EK-ricotta-pasta-alla-vodka-wfkh-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "Kosher salt",
      "1 tablespoon olive oil",
      "4 slices thick-cut bacon (6 ounces), coarsely chopped",
      "1½ teaspoons red-pepper flakes",
      "1 teaspoon dried oregano",
      "4 large garlic cloves, crushed but left whole",
      "1 medium yellow onion, finely chopped",
      "Freshly ground black pepper",
      "5 tablespoons tomato paste, preferably double-concentrated",
      "¾ to 1 cup vodka, depending on how boozy you want it",
      "1 pound fusilli, penne or rigatoni",
      "1 cup heavy cream",
      "4 ounces Pecorino Romano or Parmesan, finely grated (1 cup)",
      "1 cup/8 ounces whole-milk ricotta",
      "Finely chopped flat-leaf parsley or basil, for serving"
    ],
    "full_instructions": [
      "Bring a large pot of salted water to a boil.",
      "Heat a large, high-sided skillet over medium-high. Add the oil and bacon and cook, stirring occasionally, until the bacon is crispy at the edges, about 5 minutes. Carefully drain all but 3 tablespoons of the fat, reserving any excess for later.",
      "Lower the heat to medium. Stir in the red-pepper flakes, oregano and garlic and cook, stirring constantly, until fragrant, just a few seconds. Add the onion, season generously with salt and pepper and cook over medium-high, stirring, until the onion is translucent, about 5 minutes. Add more bacon fat if the pan dries out. Add the tomato paste and stir constantly until slightly darker in color, about 3 minutes. Turn off the heat and stir in the vodka.",
      "Add the pasta to the boiling water and cook according to package instructions until 2 minutes shy of al dente.",
      "While the pasta cooks, turn the heat under the sauce to high and cook, stirring constantly, until reduced by three-quarters, about 2 minutes. Add the cream and bring to a simmer. Take off the heat.",
      "Reserve 2 cups of the pasta water. Drain the pasta and add to the pan with the sauce, along with 1 cup pasta water and most of the pecorino. Cook over medium-high, stirring vigorously with one hand while moving the pan back and forth with the other, until the sauce glossily drapes the noodles, 5 to 7 minutes. Add more pasta water if the sauce looks dry. Fish out the garlic cloves. Taste and season with more salt and pepper, as desired.",
      "Divide the pasta among plates, sprinkling with any remaining pecorino and dolloping each serving with three spoonfuls of ricotta. Top with the parsley, which adds necessary freshness to counter the richness."
    ]
  },
  {
    "name": "Edamame Pesto Pasta",
    "url": "https://cooking.nytimes.com/recipes/1024168-edamame-pesto-pasta",
    "image": "https://static01.nyt.com/images/2023/05/10/multimedia/hm-pasta-with-edamame-pesto-gmwf/hm-pasta-with-edamame-pesto-gmwf-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "Kosher salt (such as Diamond Crystal) and black pepper",
      "1 (12-ounce) package frozen shelled edamame",
      "1 pound short pasta, such as fusilli, rigatoni or cavatappi",
      "4 garlic cloves, peeled and roughly chopped",
      "1½ packed cups soft herbs such as basil, parsley or mint leaves (or a combination), plus more to serve",
      "⅓ cup roasted unsalted sunflower or pumpkin seeds",
      "½ cup extra virgin olive oil, plus more for serving",
      "3 to 4 tablespoons lemon juice (from 1 to 2 lemons), plus more for serving",
      "3 tablespoons nutritional yeast (or grated hard cheese like pecorino or Parmesan)",
      "Red-pepper flakes, to serve"
    ],
    "full_instructions": [
      "Bring a large pot of salted water to a boil. Add the edamame and cook for 3 to 4 minutes, until just tender. Using a slotted spoon or ladle, remove the edamame and place in a colander. Rinse under cold water, then allow to drain and cool.",
      "To the same water (top it up with hot tap water if needed), add the pasta. Cook according to package instructions.",
      "Meanwhile, to a food processor or high-speed blender, add the cooled edamame, garlic, herbs and seeds and blitz for 8 to 10 seconds until the mixture resembles coarse crumbs. With the motor running, trickle in the olive oil and 2 to 3 tablespoons of water, and blitz until it resembles a thick paste. (It doesn’t need to be smooth, some texture is preferred.) Stir in 3 tablespoons lemon juice, nutritional yeast, 1 teaspoon of salt and a few pinches of black pepper. Taste and adjust salt and lemon juice until you are happy with the balance.",
      "When the pasta is ready, reserve 2 cups of the cooking water and drain the pasta. Place the pot back on medium heat and add the edamame pesto, along with 1 cup of pasta cooking water. Stir until the pesto and water has emulsified, then add the pasta and stir to coat. If it looks dry, add just enough pasta cooking water for the sauce to look loose.",
      "To serve, finish with a drizzle of olive oil, a squeeze of lemon juice, a scatter of red-pepper flakes and a few torn herbs."
    ]
  },
  {
    "name": "Roasted White Bean and Tomato Pasta",
    "url": "https://cooking.nytimes.com/recipes/1024062-roasted-white-bean-and-tomato-pasta",
    "image": "https://static01.nyt.com/images/2023/03/22/multimedia/aw-roasted-white-bean-and-tomato-pasta-wjzp/aw-roasted-white-bean-and-tomato-pasta-wjzp-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "Salt and black pepper",
      "¾ cup plus 2 tablespoons extra-virgin olive oil",
      "1 large shallot, finely minced",
      "2 tablespoons tomato paste",
      "5 garlic cloves, thinly sliced",
      "½ teaspoon finely chopped fresh rosemary (or ¼ teaspoon dried)",
      "½ teaspoon red-pepper flakes",
      "½ teaspoon granulated sugar",
      "16 ounces cherry tomatoes, halved",
      "1 (15-ounce) can small white beans (preferably navy or cannellini beans), rinsed (or 1⅓ cups cooked white beans)",
      "1 pound orecchiette (or other shaped pasta that will cup or grasp the sauce)",
      "Freshly grated Parmesan or pecorino (optional), for serving"
    ],
    "full_instructions": [
      "Heat the oven to 375 degrees. Bring a large pot of salted water to a boil over high.",
      "In a small bowl, stir together ¼ cup olive oil with the shallot, tomato paste, garlic, rosemary, red-pepper flakes and sugar. On a large baking sheet, toss the tomatoes with the dressing; season generously with salt and pepper, then spread in an even layer.",
      "On a second baking sheet, toss the beans with 2 tablespoons olive oil; season generously with salt and pepper.",
      "Roast the tomatoes and beans, stirring halfway through, until tomatoes slump and beans crisp, about 25 minutes.",
      "While the tomatoes and beans roast, cook the pasta until al dente. Reserve 1 cup pasta cooking water then drain pasta.",
      "Transfer the beans and tomatoes to the pot. Add ¼ cup pasta cooking water to the sheet pan from the tomatoes and use a flexible spatula to scrape the browned bits from the bottom of the sheet pan; transfer to the pot, then repeat with another ¼ cup pasta cooking water. (One thing they’ll teach you in French culinary school: Never, ever discard the sucs, those browned bits at the bottom of the pan that carry deep flavor.)",
      "Add the pasta and the remaining ½ cup olive oil to the pot; stir vigorously until saucy. Season generously with salt and pepper, then add extra pasta water as needed to moisten until glossy. Divide among wide, shallow bowls and top with grated cheese, if desired."
    ]
  },
  {
    "name": "Sardine Pasta Puttanesca",
    "url": "https://cooking.nytimes.com/recipes/1024285-sardine-pasta-puttanesca",
    "image": "https://static01.nyt.com/images/2023/06/29/multimedia/SE-sardine-pasta-puttanesca-czkb/SE-sardine-pasta-puttanesca-czkb-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "Salt",
      "1 pound long pasta, like spaghetti, bucatini or linguine",
      "3 tablespoons extra-virgin olive oil",
      "2 (4- to 4.5-ounce) cans sardines packed in olive oil (see Tip), not drained",
      "4 anchovy fillets",
      "6 garlic cloves, smashed with the side of a chef’s knife then chopped",
      "Red-pepper flakes, to taste",
      "2 pints/about 4 cups cherry tomatoes",
      "¾ cup pitted black olives, very roughly chopped",
      "¼ cup drained capers",
      "1 small handful parsley sprigs, finely chopped"
    ],
    "full_instructions": [
      "Bring a high-sided skillet or medium pot of water to a boil and season with salt. Add pasta and cook, stirring occasionally, until floppy but still quite raw in the center (about 4 minutes shy of the cook time suggested on the package). Drain pasta, reserving 4 cups of the cooking liquid.",
      "When the pasta is nearly cooked, heat a medium Dutch oven over medium-low. Add the olive oil, the oil from the sardines, the anchovies and garlic. Cook, stirring frequently, until the garlic is just beginning to turn golden and the anchovies have broken down, about 3 minutes. Add red-pepper flakes and cook, stirring frequently, until aromatic, about 30 seconds.",
      "Add the tomatoes and 2 cups of the reserved pasta cooking liquid and increase heat to medium. Bring to a simmer and cook until the tomatoes are warmed through and slightly softened, 4 to 6 minutes. Use a wooden spoon or potato masher to roughly smash each one. Continue simmering until the tomato juices have slightly thickened into a sauce, about 5 minutes.",
      "Add the drained pasta and cook, stirring vigorously, until the sauce coats the noodles and the pasta has cooked to your desired final texture, adding more pasta cooking liquid as needed, about 2 minutes. Add the sardines, olives, capers and parsley, stirring to evenly distribute and break up the sardines. Divide among plates and serve right away."
    ]
  },
  {
    "name": "Gochujang Buttered Noodles",
    "url": "https://cooking.nytimes.com/recipes/1024066-gochujang-buttered-noodles",
    "image": "https://static01.nyt.com/images/2023/03/31/multimedia/31-GOCHUJANGREX1-gochujang-buttered-noodles-zqlg/31-GOCHUJANGREX1-gochujang-buttered-noodles-zqlg-articleLarge-v2.jpg?w=1280&q=75",
    "ingredients": [
      "1 pound spaghetti or other long pasta",
      "6 tablespoons unsalted butter",
      "12 garlic cloves, finely chopped (about ⅓ cup)",
      "Kosher salt and black pepper",
      "¼ cup gochujang paste (not sauce; see Tip)",
      "¼ cup honey",
      "¼ cup sherry vinegar or rice vinegar",
      "Finely chopped cilantro or thinly sliced scallions (optional)"
    ],
    "full_instructions": [
      "Bring a large pot of water to a boil. Add the spaghetti and cook according to package instructions. Reserve 1 cup of the cooking water. Drain the spaghetti and return to its pot.",
      "While the pasta cooks, melt 4 tablespoons of the butter in a skillet over medium-low. Add the garlic and season generously with salt. Cook, stirring occasionally, until the garlic starts to soften but not brown, 1 to 3 minutes.",
      "Stir in the gochujang, honey and vinegar, and bring to a simmer over medium-high. Cook, stirring constantly, until the mixture reduces significantly, 3 to 4 minutes; when you drag a spatula across the bottom of the pan, it should leave behind a trail that stays put for about 3 seconds. Remove from the heat.",
      "Transfer the sauce to the pot with the spaghetti and add the remaining 2 tablespoons butter. Vigorously stir until the butter melts. Add splashes of the pasta cooking water, as needed, to thin out the sauce. Taste and season with salt and pepper. Top with the cilantro or scallions (if using) and serve immediately."
    ]
  },
  {
    "name": "Crisp Gnocchi With Sausage and Peas",
    "url": "https://cooking.nytimes.com/recipes/1024164-crisp-gnocchi-with-sausage-and-peas",
    "image": "https://static01.nyt.com/images/2023/05/04/multimedia/as-gnocchi-sausage-and-peas-lghq/as-gnocchi-sausage-and-peas-lghq-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "3 tablespoons extra-virgin olive oil, plus more as needed",
      "1 (12- to 18-ounce) package shelf-stable potato gnocchi",
      "1 pound hot or sweet Italian sausage, casings removed",
      "2 cups/10 ounces frozen peas (no need to thaw)",
      "1 tablespoon Dijon mustard",
      "½ cup/1 ounce grated Parmesan, plus more for serving",
      "Salt and pepper",
      "½ cup torn dill, mint or basil leaves, plus more for serving"
    ],
    "full_instructions": [
      "In a large (12-inch) nonstick or well-seasoned cast-iron skillet, heat 1 tablespoon oil over medium-high. Break up any stuck-together gnocchi and add to the skillet in an even layer. Cover and cook, undisturbed, until the gnocchi are golden brown underneath and unstuck from skillet, 2 to 4 minutes. Cook, stirring, until crisp on both sides, 2 to 3 minutes. If the gnocchi are burning instead of browning or the skillet looks dry, add more oil. Transfer to a bowl or plate.",
      "Add the remaining 2 tablespoons oil to the skillet, still over medium-high. Add the sausage and break into small pieces. Cook, undisturbed, until sausage is browned, 2 to 4 minutes. Stir and cook until the sausage is cooked through, another 2 to 4 minutes.",
      "Stir in the peas, mustard and ½ cup water and scrape up the browned bits on the skillet. (It may not look like a lot of liquid, but the peas will release some as they cook.) Simmer until the peas are cooked through, 2 to 4 minutes.",
      "Add the browned gnocchi and the Parmesan; stir until the cheese has melted. Season to taste with salt and pepper, then stir in the herbs. Serve topped with more herbs, Parmesan and black pepper as desired."
    ]
  },
  {
    "name": "One-Pot Tortellini With Meat Sauce",
    "url": "https://cooking.nytimes.com/recipes/1024107-one-pot-tortellini-with-meat-sauce",
    "image": "https://static01.nyt.com/images/2023/04/12/dining/AS-One-Pot-Tortellini-With-Meat-Sauce/AS-One-Pot-Tortellini-With-Meat-Sauce-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "4 garlic cloves, peeled",
      "2 tablespoons extra-virgin olive oil",
      "2 tablespoons tomato paste",
      "1 pound hot or sweet Italian sausage, casings removed",
      "1 (28-ounce) can whole or crushed tomatoes",
      "Salt and pepper",
      "About 1 pound fresh or frozen cheese tortellini (no need to thaw)",
      "Finely grated Parmesan, for serving",
      "½ cup/4 ounces grated mozzarella (optional)"
    ],
    "full_instructions": [
      "Finely grate the garlic into a large Dutch oven or skillet. Add the olive oil and tomato paste and set over medium-high heat. When it sizzles, stir until the oil is a rusty red, 1 to 2 minutes. Add the sausage, breaking it into small pieces. Cook, stirring occasionally, until the sausage is starting to crisp, 8 to 10 minutes.",
      "Stir in the tomatoes. (If using whole tomatoes, break them up with your spoon.) Season with salt and pepper and scrape up the browned bits from the bottom of the pot. Simmer over medium until thickened, 10 to 15 minutes.",
      "Stir in the tortellini, cover and cook until tender, 7 to 10 minutes, stirring halfway through and scraping any that might be stuck to the bottom of the pot. If the sauce looks dry, add ¼ cup water. Season to taste with salt and pepper and serve topped with Parmesan.",
      "If you’d like a melted-cheese top like a baked pasta, heat the broiler with a rack in the upper third of the oven. Sprinkle the tortellini with the mozzarella. Broil until melted and browned in spots, 2 to 4 minutes."
    ]
  },
  {
    "name": "Creamy Chickpea Pasta With Spinach and Rosemary",
    "url": "https://cooking.nytimes.com/recipes/1020529-creamy-chickpea-pasta-with-spinach-and-rosemary",
    "image": "https://static01.nyt.com/images/2021/10/26/dining/aw-creamy-chickpea-pasta/aw-creamy-chickpea-pasta-articleLarge-v2.jpg?w=1280&q=75",
    "ingredients": [
      "Kosher salt",
      "¼ cup olive oil",
      "1 (14-ounce) can chickpeas, rinsed and drained",
      "2 teaspoons finely chopped fresh rosemary, plus more for garnish",
      "½ teaspoon Aleppo pepper, or ¼ to ½ teaspoon red-pepper flakes (optional)",
      "Black pepper",
      "1 large shallot, finely chopped",
      "2 garlic cloves, finely chopped",
      "1 cup heavy cream",
      "1 (6-ounce) bag baby spinach",
      "12 ounces spaghetti or bucatini",
      "½ cup finely grated Parmesan",
      "Lemon wedges, for serving"
    ],
    "full_instructions": [
      "Bring a large pot of salted water to a boil over high.",
      "In a wide, deep skillet, heat the oil over medium-high. Add the chickpeas, rosemary and Aleppo pepper, if using. Season generously with salt and pepper, and cook, stirring occasionally, until chickpeas start to caramelize at their edges and pop, 5 to 7 minutes. Using a slotted spoon, transfer about half the chickpeas to a bowl. Reserve for garnish.",
      "Reduce the heat to medium, add the shallots and garlic to the skillet, and season with salt and pepper. Cook, stirring occasionally, until shallots are softened, about 3 minutes. Add the heavy cream and cook until slightly thickened, about 3 minutes. Turn off the heat, stir in the spinach and season to taste with salt and pepper.",
      "Add the pasta to the boiling water and reduce the heat to medium. Cook the pasta until a couple minutes short of al dente according to package instructions, about 5 minutes. Do not drain the pasta, but using tongs, transfer the pasta directly from the pot to the spinach and cream sauce. Add 1 cup pasta cooking water and the Parmesan, and cook over medium-high, stirring vigorously with the tongs, until the sauce is thickened and the noodles are al dente, about 2 minutes. Add a splash of pasta water to loosen sauce, if needed.",
      "Transfer to bowls, and top with reserved chickpeas, rosemary and black pepper. Serve immediately, with lemon wedges for squeezing on top."
    ]
  },
  {
    "name": "Medieval Hummus",
    "url": "https://cooking.nytimes.com/recipes/1024443-medieval-hummus",
    "image": "https://static01.nyt.com/images/2023/07/30/multimedia/30EAThummus-wtlh/30EAThummus-wtlh-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "⅓ cup raw hazelnuts",
      "1½ tablespoons caraway seeds",
      "1 tablespoon coriander seeds",
      "1½ teaspoons sesame seeds",
      "¼ cup shelled roasted unsalted pistachios",
      "5 mint leaves",
      "1 small sprig tarragon, leaves only",
      "3½ cups cooked drained chickpeas (homemade from 8 ounces dried chickpeas or from two 15-ounce cans chickpeas)",
      "½ cup tahini",
      "¼ cup olive oil, plus more for drizzling",
      "2 tablespoons fresh lemon juice, plus more to taste (see Tip)",
      "½ tablespoon ground sumac, plus more for sprinkling",
      "1½ teaspoons rice vinegar",
      "Salt",
      "½ cup ice-cold water"
    ],
    "full_instructions": [
      "In a small skillet over medium-low heat, toast the hazelnuts, stirring occasionally, until fragrant and the skins begin to split, 3 to 4 minutes, then transfer to a plate lined with a paper towel. When cool, gently rub off the skins and discard.",
      "Using the same pan, toast the caraway, coriander and sesame seeds, stirring occasionally, until fragrant, about 2 minutes, then remove from heat to cool slightly (the seeds will continue to toast).",
      "Add the toasted hazelnuts and the pistachios to a food processor and pulse until they release their oils and make a compact paste, 3 to 4 minutes. Add the mint and tarragon and pulse to combine.",
      "Add the chickpeas to the mixture in the food processor, reserving a handful for garnish. Then add the tahini, olive oil, lemon juice, the toasted seeds, sumac, rice vinegar and a pinch of salt. Start pulsing and gradually add the ice water, splash by splash, until creamy and smooth. Taste and add more lemon juice or salt, as desired.",
      "Spoon the hummus onto a plate. (If you like, use a piping bag and experiment with different tips for an artful presentation.) Drizzle with olive oil, dust with sumac and finish with a few chickpeas on top."
    ]
  },
  {
    "name": "Chickpea Salad Sandwich",
    "url": "https://cooking.nytimes.com/recipes/1022291-chickpea-salad-sandwich",
    "image": "https://static01.nyt.com/images/2021/07/12/dining/kc-chickpea-salad-sandwich/kc-chickpea-salad-sandwich-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "6 tablespoons extra-virgin olive oil",
      "6 tablespoons tahini",
      "3 tablespoons fresh lemon juice",
      "½ teaspoon grated garlic",
      "Kosher salt and pepper",
      "2 (15-ounce) cans chickpeas, rinsed and drained",
      "½ cup finely chopped celery",
      "½ cup finely chopped scallions",
      "½ cup freshly grated Parmigiano-Reggiano",
      "8 slices multigrain sandwich bread",
      "Mayonnaise, as needed",
      "8 butter lettuce leaves",
      "1 (packed) cup alfalfa sprouts",
      "1 avocado, thinly sliced",
      "1 large tomato, thinly sliced"
    ],
    "full_instructions": [
      "In a large bowl, combine oil, tahini, lemon juice and garlic. Season with salt and pepper, then whisk until well combined. Add chickpeas and mash with the back of a fork or spoon until chunky. Add celery, scallions and cheese, and mix well. Season with salt and pepper.",
      "Spread one side of each bread slice with mayonnaise. On 4 slices of bread, divide lettuce, alfalfa and avocado, then top with some of the chickpea salad and tomatoes. Close sandwiches and serve. (Sandwiches may sit at room temperature for 1 to 2 hours before serving.)"
    ]
  },
  {
    "name": "5-Minute Hummus",
    "url": "https://cooking.nytimes.com/recipes/1019619-5-minute-hummus",
    "image": "https://static01.nyt.com/images/2021/04/17/dining/03Cookbooks4-copy/merlin_144070329_05e7a607-69e8-4a4b-b851-0a866ba3aae8-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "¼ garlic clove",
      "Juice of 1 lemon, about ¼ cup",
      "1 (16-ounce) jar tahini",
      "1 tablespoon kosher salt",
      "1 teaspoon ground cumin",
      "1 to 1½ cups ice water",
      "2 (15-ounce) cans chickpeas, drained and rinsed"
    ],
    "full_instructions": [
      "Drop the ¼ garlic clove into a food processor and add the lemon juice. Pour the tahini on top, making sure to scrape it all out of the container, and add the salt and cumin. Process until the mixture looks peanut-buttery, about 1 minute. Stream in the ice water, a little at a time, with the motor running. Process just until the mixture is smooth and creamy and lightens to the color of dry sand.",
      "Add the chickpeas and process for about 3 minutes, scraping the sides of the bowl as you go, until the chickpeas are completely blended and the hummus is smooth and uniform in color."
    ]
  },
  {
    "name": "Braised Chicken With Rosemary, Chickpeas and Salted Lemon",
    "url": "https://cooking.nytimes.com/recipes/1020549-braised-chicken-with-rosemary-chickpeas-and-salted-lemon",
    "image": "https://static01.nyt.com/images/2019/10/22/dining/yk-rosemary-chicken-with-salted-lemon-and-chickpeas/merlin_162312300_34263f89-3d23-4a52-bb0e-8e7923d30b56-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "2½ pounds whole chicken legs or bone-in, skin-on thighs",
      "1 lemon, halved lengthwise",
      "1 teaspoon kosher salt, plus more to taste",
      "2 tablespoons olive oil, plus more as needed",
      "1 medium onion, peeled and thinly sliced",
      "4 garlic cloves, smashed",
      "1 fresh rosemary sprig",
      "½ cup dry white wine",
      "1 (15-ounce) can whole peeled tomatoes",
      "1 (15-ounce) can chickpeas, rinsed",
      "Black pepper",
      "4 cups hearty greens like spinach, kale or mustard greens, trimmed and torn",
      "1 cup mix of fresh herbs like dill, parsley and mint",
      "Full-fat Greek yogurt, for serving"
    ],
    "full_instructions": [
      "If using whole chicken legs, cut the joint just enough to bend the leg, and make a deep, 2-inch-long cut on the meat without cutting all the way through.",
      "Cut one half of the lemon crosswise into ⅛-inch-thick half moons. Transfer them to a medium bowl. Sprinkle with 1 teaspoon salt and use a fork to lightly crush the slices and release the juice. Cut the other lemon half into wedges for serving.",
      "Pat the chicken pieces dry and season both sides with salt. In a large lidded skillet or Dutch oven, heat 2 tablespoons oil over medium-high. Working in batches if necessary, add the chicken pieces skin-side down, cover, and cook until the skin is golden brown, about 8 to 10 minutes. Flip, cover and cook for another minute or two, then transfer chicken to a plate. If working in batches, add 2 more tablespoons oil to the skillet, sear the remaining chicken legs then transfer them to the plate.",
      "Pour off all but about 2 tablespoons of fat from the pan. Add the onions and sauté until just softened, about 2 minutes, then add the garlic and rosemary and cook until fragrant, about 1 minute. Add the white wine, then add the tomatoes with their juices, crushing the tomatoes with your hands as you go. Rinse the tomato can with 1 cup water. Add the water and the chickpeas to the pan. Season lightly with salt and black pepper.",
      "Bring to a boil, return the chicken and any accumulated juices to the pan and reduce heat to low. Cover and simmer until the chicken is cooked through and tender, 15 to 18 minutes.",
      "Uncover the pot and transfer the chicken to bowls or a large rimmed serving platter. Add the sliced lemon plus any accumulated juices to the pot, increase the heat to medium-high and allow to thicken slightly, 2 to 3 minutes. Discard the rosemary stem, then stir in the hearty greens, remove from heat and season with additional salt if needed.",
      "To serve, spoon the stew over the chicken legs, top with a handful of the herbs, yogurt and fresh lemon wedges for squeezing. Drizzle with olive oil, if desired, and serve with steamed couscous or slices of crusty bread for dipping."
    ]
  },
  {
    "name": "Vegan Caesar Salad With Crisp Chickpeas",
    "url": "https://cooking.nytimes.com/recipes/1020763-vegan-caesar-salad-with-crisp-chickpeas",
    "image": "https://static01.nyt.com/images/2020/01/02/dining/bh-vegan-caesar/bh-vegan-caesar-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "½ small loaf crusty bread, such as sourdough, torn into 1-inch pieces (about 2 cups)",
      "¼ cup extra-virgin olive oil",
      "Kosher salt and freshly ground black pepper",
      "1 (14-ounce) can chickpeas, drained, rinsed and thoroughly dried",
      "1 large bunch lacinato kale, stems removed and roughly chopped into 1-inch pieces (about 4 cups)",
      "1 large head romaine lettuce, roughly chopped into 1-inch pieces (about 6 cups)",
      "1 cup whole (unroasted) cashews",
      "1 snack-size (2-by-3-inch) sheet roasted nori, crumbled (optional)",
      "¼ cup nutritional yeast, plus more for serving",
      "¼ cup fresh lemon juice (from 1 to 2 lemons)",
      "3 garlic cloves",
      "2 teaspoons brine from a jar of capers",
      "1 teaspoon Dijon mustard",
      "1 teaspoon white miso paste",
      "¾ teaspoon kosher salt",
      "½ teaspoon freshly ground black pepper"
    ],
    "full_instructions": [
      "Heat the oven to 400 degrees. On a medium baking sheet, toss the bread with 2 tablespoons olive oil; season generously with salt and pepper. On a second baking sheet, toss the chickpeas with remaining 2 tablespoons oil; season generously with salt and pepper. Bake both until chickpeas and croutons are browned and crisp, stirring both halfway through, about 10 minutes for the croutons and 20 minutes for the chickpeas. Set aside.",
      "While the chickpeas and croutons roast, prepare your dressing: To a high-speed blender, add all the dressing ingredients, plus ¾ teaspoon kosher salt, ½ teaspoon pepper and ¾ cup water; blend until completely smooth, 3 to 4 minutes, scraping down the sides with a rubber spatula every now and again. Set dressing aside. (You should have 1½ cups).",
      "In a large bowl, add the kale and the dressing. Using your hands, massage the kale until slightly softened. Add the lettuce, croutons and half the roasted chickpeas; toss to coat and season to taste with salt and pepper. Sprinkle with additional nutritional yeast. Top with remaining roasted chickpeas; grind black pepper over, and serve immediately."
    ]
  },
  {
    "name": "Curry Chicken Breasts With Chickpeas and Spinach",
    "url": "https://cooking.nytimes.com/recipes/1020309-curry-chicken-breasts-with-chickpeas-and-spinach",
    "image": "https://static01.nyt.com/images/2020/04/26/dining/kc-chicken-and-chickpeas/kc-chicken-and-chickpeas-articleLarge-v2.jpg?w=1280&q=75",
    "ingredients": [
      "¼ cup all-purpose flour",
      "4 (6-ounce) boneless, skinless chicken breasts, pounded ½-inch thick",
      "Kosher salt and black pepper",
      "¼ cup canola oil",
      "2 tablespoons Madras curry powder",
      "1 (15-ounce) can chickpeas, rinsed",
      "2 tablespoons unsalted butter",
      "1 tablespoon fresh lime juice, plus wedges for serving",
      "4 ounces baby spinach (about 4 packed cups)",
      "Chopped fresh cilantro (optional)"
    ],
    "full_instructions": [
      "Place flour on a plate. Season chicken with salt and pepper, then lightly dredge in flour until coated.",
      "In a large nonstick skillet, heat 1 tablespoon oil over medium. Add 2 chicken cutlets and cook until golden and cooked through, about 3 minutes per side. Transfer to plates. Repeat with 1 tablespoon oil and remaining cutlets, transferring cutlets to plates.",
      "Add remaining 2 tablespoons oil to the skillet, then curry powder and chickpeas. Season with salt and pepper and cook over medium heat, stirring frequently, until chickpeas are golden and starting to pop, about 3 minutes. Add butter, lime juice and spinach and stir just until spinach starts to wilt, about 30 seconds. Spoon chickpea mixture over chicken and top with cilantro, if using. Serve with lime wedges."
    ]
  },
  {
    "name": "Beet Salad With Coriander-Yogurt Dressing",
    "url": "https://cooking.nytimes.com/recipes/1023641-beet-salad-with-coriander-yogurt-dressing",
    "image": "https://static01.nyt.com/images/2022/11/16/dining/09komolaferex1-beet/merlin_215733927_2f76a145-a50c-46e4-b8ce-b09a0460c7c3-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "1 (15½-ounce) can chickpeas, drained and rinsed",
      "Salt and freshly ground black pepper",
      "1½ teaspoons ground coriander",
      "3 tablespoons olive oil",
      "1 orange",
      "¼ cup full-fat Greek yogurt",
      "3 tablespoons rice vinegar",
      "2 pounds cooked whole red or golden beets (store-bought or homemade), peeled and cut into ½-inch-thick rounds",
      "3 cups baby arugula"
    ],
    "full_instructions": [
      "Heat the oven to 400 degrees. Spread the chickpeas on a small baking sheet and pat dry with a kitchen towel. Season lightly with salt, black pepper, ½ teaspoon coriander and 1 tablespoon olive oil. Roast the chickpeas until golden brown and crispy, shaking the sheet halfway through baking, 20 minutes. Remove from the oven, and while still warm, zest the orange over the roasted chickpeas. Stir to combine.",
      "Meanwhile, in a small bowl, whisk the yogurt, 1 tablespoon olive oil, 2 tablespoons rice vinegar and the remaining 1 teaspoon ground coriander. Season with salt and pepper to taste.",
      "In a medium bowl, toss the beets, remaining 1 tablespoon olive oil, remaining 1 tablespoon rice vinegar and season with salt and pepper. Add the arugula and toss to combine.",
      "To serve, spread half of the yogurt dressing on a serving platter. Add the beet mixture and scatter the chickpeas all over the top. Spoon the remaining yogurt dressing over everything and serve immediately."
    ]
  },
  {
    "name": "Pasta e Ceci (Italian Pasta and Chickpea Stew)",
    "url": "https://cooking.nytimes.com/recipes/1020860-pasta-e-ceci-italian-pasta-and-chickpea-stew",
    "image": "https://static01.nyt.com/images/2020/08/23/dining/ch-pasta-e-ceci-soup/ch-pasta-e-ceci-soup-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "3 tablespoons olive oil, plus more for drizzling",
      "1 medium yellow onion, finely chopped",
      "3 garlic cloves, finely chopped",
      "2 teaspoons chopped fresh rosemary",
      "½ teaspoon red-pepper flakes",
      "Kosher salt and black pepper",
      "1 packed cup canned whole tomatoes, drained",
      "1 (15-ounce) can chickpeas, rinsed",
      "1 cup ditalini",
      "4 cups roughly chopped escarole, Tuscan kale or radicchio",
      "Grated pecorino, for serving"
    ],
    "full_instructions": [
      "Heat the oil in a large stock pot or Dutch oven over medium. Add the onion and cook, stirring occasionally, until softened but not taking on any color, 4 to 5 minutes. Add the garlic, rosemary and red-pepper flakes, and cook 1 minute more. Season well with salt and pepper.",
      "Stir in the tomatoes and the chickpeas, breaking up the tomatoes with the back of a spoon or spatula and smashing about ½ cup of the beans.",
      "Add 3 cups water and bring to a boil over high. Add the pasta and simmer, stirring often to make sure nothing sticks to the bottom of the pan, until the pasta is al dente, about 10 minutes. The water will mostly be absorbed by the pasta, but if you prefer it brothier, you can add ½ to 1 cup water and simmer until warmed through, 1 minute more. Season to taste with salt and pepper.",
      "Add the escarole and stir until wilted. Taste and adjust seasonings accordingly. Ladle into bowls and top with grated cheese and a drizzle of olive oil."
    ]
  },
  {
    "name": "Sheet-Pan Chicken Thighs With Spicy Corn",
    "url": "https://cooking.nytimes.com/recipes/1024458-sheet-pan-chicken-thighs-with-spicy-corn",
    "image": "https://static01.nyt.com/images/2023/07/26/multimedia/26apperex-chicken-mpwq/26apperex-chicken-mpwq-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "2 pounds boneless, skinless chicken thighs",
      "1¾ teaspoons fine sea or table salt",
      "2 tablespoons mayonnaise",
      "¼ cup finely chopped basil, plus more for garnish",
      "2 garlic cloves, finely grated or minced",
      "⅓ cup chopped pickled jalapeños, plus brine from the jar",
      "4 cups fresh or frozen corn kernels (from about 4 ears)",
      "3 tablespoons olive oil, plus more for drizzling",
      "5 scallions, thinly sliced",
      "1 jalapeño, sliced into rings",
      "1 lime, halved"
    ],
    "full_instructions": [
      "Season the chicken all over with ¾ teaspoon of salt. In a large bowl, stir together the mayonnaise, basil, garlic and 2 tablespoons jalapeño brine. Add the chicken to the marinade. Cover and refrigerate for 30 minutes and up to 6 hours.",
      "Heat oven to 425 degrees. In a medium bowl, toss together corn, pickled jalapeños, olive oil, remaining 1 teaspoon salt and half of the scallions (save remaining scallions for serving).",
      "Arrange the chicken on a baking sheet, spacing it out. Roast for 12 minutes. Spoon the corn mixture onto the empty parts of the baking sheet. Drizzle chicken and corn with oil. Continue to roast until the chicken is cooked through, 10 to 15 minutes longer, stirring the corn once while roasting.",
      "Turn the broiler on high and broil the chicken and corn until golden brown in spots, 2 to 4 minutes (watch carefully so it doesn’t burn, though a little blistering is nice).",
      "Garnish chicken and corn with basil, remaining scallions and fresh jalapeño slices. Sprinkle with more pickled jalapeño brine and squeeze with lime juice. Serve hot or at room temperature."
    ]
  },
  {
    "name": "Crispy Chicken Thighs With Charred Zucchini",
    "url": "https://cooking.nytimes.com/recipes/1024309-crispy-chicken-thighs-with-charred-zucchini",
    "image": "https://static01.nyt.com/images/2023/07/25/multimedia/hew-crispy-chicken-thighs-with-charred-zucchini-mpgl/hew-crispy-chicken-thighs-with-charred-zucchini-mpgl-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "4 bone-in, skin-on chicken thighs (about 1½ pounds)",
      "Kosher salt",
      "3 medium zucchini, halved lengthwise",
      "¼ cup raw pumpkin seeds",
      "Tender cilantro sprigs, for garnish",
      "½ cup buttermilk",
      "¼ cup raw pumpkin seeds",
      "1 cup torn tender cilantro stems and leaves",
      "1 garlic clove",
      "1 jalapeño, stemmed (and seeded, if preferred)",
      "3 tablespoons lemon juice (from 1 lemon)",
      "1 teaspoon kosher salt (such as Diamond Crystal)",
      "Plain white rice"
    ],
    "full_instructions": [
      "Heat oven to 400 degrees. Use a paper towel to pat both sides of the thighs until dry. Generously season the chicken thighs all over with kosher salt. On a plate, season the cut sides of the zucchini with salt and let sit.",
      "Place the thighs skin side down in a medium or large oven-safe skillet and turn the heat to medium. Cook, undisturbed, until the fat on the chicken skin has rendered, the thighs release easily from the pan, and the skin is a golden brown with splotches of dark brown, about 15 minutes. Flip the thighs over and cook until the other side is golden brown, about 5 minutes.",
      "Transfer the chicken, skin side up, to a plate. Return the pan to medium heat. Pat the zucchini dry and place cut side down in the pan and press down firmly with a spatula. Cook until deeply charred in spots, about 3 minutes, then flip. Add ¼ cup water and scrape up any browned bits with a stiff spatula or wooden spoon. Place the thighs (and any juices) on top of the zucchini, skin side up. Scatter the pumpkin seeds around the pan and transfer skillet to the oven. Roast until thighs are cooked through, about 15 minutes.",
      "While the chicken roasts, make the sauce: To a blender, add the buttermilk, pumpkin seeds, cilantro, garlic, jalapeño, lemon juice and salt; blend until smooth.",
      "Scatter cilantro on top of the chicken and finish with a light drizzle of sauce. Serve with rice and the rest of the sauce on the side."
    ]
  },
  {
    "name": "Medieval Hummus",
    "url": "https://cooking.nytimes.com/recipes/1024443-medieval-hummus",
    "image": "https://static01.nyt.com/images/2023/07/30/multimedia/30EAThummus-wtlh/30EAThummus-wtlh-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "⅓ cup raw hazelnuts",
      "1½ tablespoons caraway seeds",
      "1 tablespoon coriander seeds",
      "1½ teaspoons sesame seeds",
      "¼ cup shelled roasted unsalted pistachios",
      "5 mint leaves",
      "1 small sprig tarragon, leaves only",
      "3½ cups cooked drained chickpeas (homemade from 8 ounces dried chickpeas or from two 15-ounce cans chickpeas)",
      "½ cup tahini",
      "¼ cup olive oil, plus more for drizzling",
      "2 tablespoons fresh lemon juice, plus more to taste (see Tip)",
      "½ tablespoon ground sumac, plus more for sprinkling",
      "1½ teaspoons rice vinegar",
      "Salt",
      "½ cup ice-cold water"
    ],
    "full_instructions": [
      "In a small skillet over medium-low heat, toast the hazelnuts, stirring occasionally, until fragrant and the skins begin to split, 3 to 4 minutes, then transfer to a plate lined with a paper towel. When cool, gently rub off the skins and discard.",
      "Using the same pan, toast the caraway, coriander and sesame seeds, stirring occasionally, until fragrant, about 2 minutes, then remove from heat to cool slightly (the seeds will continue to toast).",
      "Add the toasted hazelnuts and the pistachios to a food processor and pulse until they release their oils and make a compact paste, 3 to 4 minutes. Add the mint and tarragon and pulse to combine.",
      "Add the chickpeas to the mixture in the food processor, reserving a handful for garnish. Then add the tahini, olive oil, lemon juice, the toasted seeds, sumac, rice vinegar and a pinch of salt. Start pulsing and gradually add the ice water, splash by splash, until creamy and smooth. Taste and add more lemon juice or salt, as desired.",
      "Spoon the hummus onto a plate. (If you like, use a piping bag and experiment with different tips for an artful presentation.) Drizzle with olive oil, dust with sumac and finish with a few chickpeas on top."
    ]
  },
  {
    "name": "Saag Shrimp",
    "url": "https://cooking.nytimes.com/recipes/1024405-saag-shrimp",
    "image": "https://static01.nyt.com/images/2023/07/26/multimedia/21Komolaferex-ctfm/21Komolaferex-ctfm-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "1 teaspoon ground turmeric",
      "½ teaspoon ground ginger",
      "½ teaspoon ground cumin",
      "½ teaspoon ground coriander",
      "¼ to ½ teaspoon ground cayenne",
      "¼ teaspoon garlic powder",
      "¼ teaspoon onion powder",
      "1 pound peeled, deveined large shrimp, tails off",
      "Salt",
      "3 tablespoons ghee or neutral oil, such as grapeseed or safflower",
      "1 teaspoon whole cumin seeds",
      "1 large yellow onion, minced",
      "1 (1-inch) piece fresh ginger, scrubbed and grated",
      "3 garlic cloves, grated",
      "1 tablespoon tomato paste",
      "1 medium fresh tomato, chopped",
      "½ cup fresh cilantro leaves and stems, chopped",
      "1 pound fresh baby spinach, roughly chopped using a sharp knife or by pulsing in a food processor",
      "½ cup heavy cream or unsweetened coconut cream",
      "Steamed rice, naan, green chile chutney, tamarind chutney and fresh kachumbari, or a combination, for serving"
    ],
    "full_instructions": [
      "Make the spice blend: In a small bowl, combine turmeric, ginger, cumin, coriander, cayenne, garlic powder and onion powder.",
      "Toss the shrimp with 2 teaspoons of the spice blend and a light sprinkle of salt. Set aside.",
      "Heat a large shallow skillet over medium-high. Add the ghee and cumin seeds, and toast until fragrant, about 30 seconds. Add the onion, cook until softened and translucent, stirring frequently, 5 minutes.",
      "Add the remaining spice blend, stir and toast until fragrant, 30 seconds. Add the ginger, garlic and tomato paste. Stir and cook until the tomato paste deepens in color, about 1 minute. Reserve 1 tablespoon of the chopped tomato for garnish. Add the remaining chopped tomato, about half of the chopped cilantro and ½ cup water. Increase the heat to high and bring the sauce to a simmer. Cook the sauce, stirring until it thickens and reduces (about three-fourths of the original volume), 3 to 5 minutes. Season with salt.",
      "Add the shrimp to the skillet all at once and stir to coat with the sauce. Add the spinach in two batches, wilting the first batch before adding the second, and season with salt. Cook on high heat, stirring occasionally, until spinach is softened, shrimp is cooked through and most of the liquid has evaporated, about 4 to 5 minutes. Stir in the heavy cream and adjust the seasoning to taste with more salt, if necessary.",
      "Remove from heat and garnish with the reserved chopped tomatoes and the cilantro. Serve over steamed rice and warm, pillowy naan. Top the saag with green chile chutney, tamarind chutney or fresh kachumbari for a lovely pop of acid and heat."
    ]
  },
  {
    "name": "One-Pan Zucchini-Pesto Orzo ",
    "url": "https://cooking.nytimes.com/recipes/1024402-one-pan-zucchini-pesto-orzo",
    "image": "https://static01.nyt.com/images/2023/07/19/multimedia/19apperex-orzo-mthc/19apperex-orzo-mthc-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "2 medium zucchini (about 6 ounces each), diced (about 2½ cups)",
      "1 large yellow onion, thinly sliced",
      "¼ cup extra-virgin olive oil, more for drizzling",
      "¼ to ½ teaspoon red-pepper flakes, to taste, more as needed",
      "1½ teaspoons fine sea salt, more to taste",
      "1¾ cups vegetable or chicken stock",
      "1 cup orzo",
      "1 lemon, zested and halved",
      "1 cup halved cherry or grape tomatoes",
      "5 ounces fresh mozzarella, cut into cubes (1 cup)",
      "½ cup grated Parmesan (3 ounces), more for serving",
      "¼ cup finely chopped mint, more for serving",
      "½ cup pesto, store-bought or homemade, more to taste"
    ],
    "full_instructions": [
      "In a large nonstick or well-seasoned cast-iron skillet over medium-high heat, combine the zucchini and onion with olive oil, the red-pepper flakes and 1 teaspoon salt. Cook the mixture, stirring once or twice, until the zucchini and onion turn golden brown, 10 to 12 minutes. Don’t stir too often, as it can impede browning.",
      "Stir in stock and bring to a simmer. Stir in orzo, lemon zest and ½ teaspoon salt. Cover and simmer over medium-low heat until orzo is nearly cooked through and most of the liquid is absorbed, 10 to 14 minutes, stirring once or twice.",
      "Meanwhile, in a small bowl, toss together the tomatoes, mozzarella, a pinch of salt, a pinch of red-pepper flakes and a drizzle of olive oil, and let marinate while the orzo cooks.",
      "Once the orzo is ready, stir in juice of ½ lemon, Parmesan, mint and pesto. Cover the pan, and cook for 1 minute, to finish cooking. Taste for seasoning and add more lemon juice or pesto, if needed. To serve, top with tomato-mozzarella mixture and sprinkle with more cheese and mint."
    ]
  },
  {
    "name": "Melon Salad With Pistachio Dukkah and Basil",
    "url": "https://cooking.nytimes.com/recipes/1024308-melon-salad-with-pistachio-dukkah-and-basil",
    "image": "https://static01.nyt.com/images/2023/07/19/multimedia/hew-melon-salad-gjml/hew-melon-salad-gjml-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "2 teaspoons coriander seeds",
      "2 teaspoons fennel seeds",
      "1 teaspoon cumin seeds",
      "1 teaspoon granulated sugar",
      "¼ teaspoon kosher salt",
      "⅛ teaspoon ground cayenne",
      "¼ cup roasted, salted, shelled pistachios",
      "1 large melon, peeled, cut in half, seeded, then cut into ½ inch-thick slices",
      "Flaky salt, to taste",
      "Extra-virgin olive oil",
      "⅓ cup basil leaves, torn"
    ],
    "full_instructions": [
      "In a small skillet over medium heat, toast the coriander seeds, fennel seeds and cumin seeds, stirring constantly, until fragrant and lightly toasted, 2 to 3 minutes.",
      "Transfer to a spice grinder. Add the sugar, kosher salt and cayenne, and blend until finely ground. Add the pistachios and blend again until a coarse powder forms.",
      "Arrange the melon on a serving platter, season with flaky salt, aggressively drizzle on the oil, and rain some dukkah on top. Scatter with basil and serve with extra dukkah on the side."
    ]
  },
  {
    "name": "Poc Chuc (Citrus-Marinated Grilled Pork)",
    "url": "https://cooking.nytimes.com/recipes/1024375-poc-chuc-citrus-marinated-grilled-pork",
    "image": "https://static01.nyt.com/images/2023/07/19/multimedia/cr-poc-chuc-pork-twjp/cr-poc-chuc-pork-twjp-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "2 pounds boneless pork shoulder (or use thin-cut boneless pork chops, see Tip)",
      "Finely grated zest from 1 orange and 1 lime (optional)",
      "6 garlic cloves, finely grated",
      "½ cup orange juice",
      "½ cup grapefruit juice",
      "¼ cup fresh lime juice",
      "¼ cup white or white wine vinegar",
      "1 tablespoon kosher salt (such as Diamond Crystal) or 1 ½ teaspoons fine sea salt",
      "2 teaspoons ground black pepper",
      "2 tablespoons canola oil, plus more for grilling",
      "Warm tortillas, black beans, pickled red onions, shaved cabbage, avocado slices and orange or lime wedges, for serving (not all necessary, but encouraged)"
    ],
    "full_instructions": [
      "If you have one large chunk of pork, cut it into a few smaller pieces. Cut the pork against the grain into thin (¼-inch) slices.",
      "In a large mixing bowl, whisk the orange and lime zest, if using, with the garlic, orange, grapefruit and lime juices, vinegar, salt and pepper. Add the pork slices and toss to coat, then submerge in the marinade. Cover and refrigerate for at least 4 hours and up to overnight.",
      "Heat an outdoor grill to high, making sure the grates are clean and oiled. Meanwhile, drain the pork thoroughly, discarding the marinade. Coat the pork with 2 tablespoons of oil.",
      "Once grill grates are very hot, lay the pork down in an even layer and cook, covered, until lightly charred, about 3 minutes. Turn pork over to kiss the second side with heat for 30 seconds to 1 minute. Transfer to a serving platter.",
      "Serve the poc chuc immediately with your choice of warm tortillas, black beans, pickled red onions, shaved cabbage, avocado slices and citrus wedges."
    ]
  },
  {
    "name": "Furikake Tomato Sandwich",
    "url": "https://cooking.nytimes.com/recipes/1024442-furikake-tomato-sandwich",
    "image": "https://static01.nyt.com/images/2023/07/23/multimedia/23EAT-tomato-sandwich-zlwm/23EAT-tomato-sandwich-zlwm-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "Salt and freshly ground black pepper",
      "1 large very ripe heirloom tomato, thickly sliced crosswise",
      "4 slices soft white sandwich bread, such as brioche or milk bread",
      "Mayonnaise, for spreading",
      "Furikake rice seasoning (see Tip), for sprinkling"
    ],
    "full_instructions": [
      "Salt and pepper the tomato slices. Lightly toast the bread.",
      "Spread a generous amount of mayonnaise on each slice of bread, then sprinkle with furikake. Divide the tomato slices between 2 slices of bread, then sandwich with the remaining bread.",
      "Cut the sandwiches diagonally and eat immediately."
    ]
  },
  {
    "name": "Grated Tomato Pasta",
    "url": "https://cooking.nytimes.com/recipes/1024307-grated-tomato-pasta",
    "image": "https://static01.nyt.com/images/2023/07/14/multimedia/hew-grated-tomato-pasta-kzhw/hew-grated-tomato-pasta-kzhw-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "Salt",
      "12 ounces spaghetti (about ¾ box)",
      "4 large ripe beefsteak or heirloom tomatoes",
      "⅓ cup extra-virgin olive oil",
      "4 garlic cloves, finely grated",
      "1 cup grated Parmesan, plus more for garnish",
      "½ cup basil leaves, plus more for garnish"
    ],
    "full_instructions": [
      "Over high heat, bring a large pot of salted water to a boil. Add pasta to the water and boil 1 minute less than package instructions, or until the spaghetti has a very tiny dry core when cut in half.",
      "While the pasta cooks, trim the bottom of the tomatoes and core them. Using the large holes on the box grater, grate the trimmed side of the tomato into a large bowl until nothing but skins remain. Discard skins.",
      "Transfer the pasta to a colander to drain, then return the pot to medium-high heat. Add the olive oil and garlic and cook, frequently stirring, until the garlic is fragrant, about 1 minute.",
      "Add the grated tomatoes and season with a large pinch of salt. As soon as the mixture comes up to a simmer (about 3 minutes), turn off the heat and add the spaghetti and half the Parmesan. Stir vigorously until the spaghetti is coated in sauce and the Parmesan has melted.",
      "Add the rest of the Parmesan and the basil leaves and stir vigorously until the rest of the cheese has melted. Taste the sauce and adjust with more salt as needed.",
      "Divide among four bowls, spooning over any tomato liquid left in the pot. Top with more Parmesan and basil and serve immediately."
    ]
  },
  {
    "name": "Crispy Potato Tacos",
    "url": "https://cooking.nytimes.com/recipes/1024397-crispy-potato-tacos",
    "image": "https://static01.nyt.com/images/2023/07/14/multimedia/14EVERYDAY-VEGETABLESrex1-pvqb/14EVERYDAY-VEGETABLESrex1-pvqb-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "Sea salt",
      "1½ pounds potatoes (any variety), scrubbed and cut into 1½-inch pieces",
      "1½ cups grated Cheddar",
      "Handful of cilantro, leaves and stems finely chopped",
      "1 small garlic clove, finely chopped",
      "1 teaspoon ground cumin",
      "1 teaspoon paprika",
      "16 to 18 corn tortillas",
      "Neutral oil, as needed",
      "Any combination of sliced lettuce or cabbage, very finely sliced red onion or sour cream (all optional), for serving",
      "3 tomatoes (about 1 pound), chopped",
      "½ red onion, roughly chopped",
      "Small handful of cilantro, leaves and stems roughly chopped",
      "1 fresh serrano or Fresno chile (seeded, if you prefer less spice)",
      "1 garlic clove, chopped",
      "1 teaspoon ground cumin",
      "1 teaspoon dried oregano",
      "1 teaspoon granulated sugar",
      "Sea salt",
      "¾ cup vegetable stock"
    ],
    "full_instructions": [
      "Bring a large saucepan of salted water to a boil. Add the potatoes and cook for 15 to 20 minutes, until tender. (Check them by inserting a fork or knife into the largest potato piece. If it goes in and out easily, the potato is ready.) Drain and allow to cool for a few minutes.",
      "Make the spicy red salsa: Place tomatoes, onion, cilantro, chile, garlic, cumin, oregano, sugar and 1 teaspoon salt into a blender or food processor and blitz until completely smooth. Pour the purée into a saucepan, add the vegetable stock and bring to a boil. Reduce the heat to low and simmer for 15 to 20 minutes until darker in color and slightly thickened, while you prepare the remaining ingredients.",
      "Place the cooled potatoes in a bowl and roughly mash them. (It does not have to be smooth; a chunky texture is great.) Add the Cheddar, cilantro, garlic, cumin, paprika and 1 teaspoon sea salt and mix to combine.",
      "Place a large skillet over medium-high heat and, working in batches, add the corn tortillas and heat until soft and pliable. Remove from the pan and cover the tortillas with a clean kitchen towel to keep them warm. Fill each warmed tortilla with 1 to 2 tablespoons of the potato mixture, then fold in half and press down lightly.",
      "In the same skillet, add enough oil to cover the bottom of the pan and warm over medium-high heat. Place three or four tacos in the oil, pressing down lightly with a spatula so that the edges are in the oil, and fry for 1 to 2 minutes, until golden and crispy. Flip them over and repeat on the other side. Repeat with the remaining tacos.",
      "Serve the tacos with the spicy red salsa and any of the optional serving suggestions. (The potatoes can be cooked and mashed 2 days ahead and stored in an airtight container in the fridge. The salsa can be made 2 days ahead and kept in the fridge. For freezing info, see Tip.)"
    ]
  },
  {
    "name": "Salt and Vinegar Kale Chips With Fried Chickpeas and Avocado",
    "url": "https://cooking.nytimes.com/recipes/1024395-salt-and-vinegar-kale-chips-with-fried-chickpeas-and-avocado",
    "image": "https://static01.nyt.com/images/2023/07/14/multimedia/14EVERYDAY-VEGETABLESrex4-lmqf/14EVERYDAY-VEGETABLESrex4-lmqf-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "6 ounces kale leaves (from 1 bunch), washed and dried, then torn",
      "Extra-virgin olive oil, as needed",
      "3 tablespoons malt vinegar or apple cider vinegar",
      "1 garlic clove, grated",
      "Sea salt and black pepper",
      "3 cups cooked chickpeas (from about two 15-ounce cans, drained), patted dry",
      "1 teaspoon paprika",
      "½ to 1 teaspoon ground cayenne",
      "4 large eggs (optional)",
      "2 avocados, sliced"
    ],
    "full_instructions": [
      "Heat the oven to 275 degrees.",
      "Place the kale leaves on a sheet pan and add 2 to 3 tablespoons of olive oil (just enough to coat the leaves), plus the vinegar and garlic. Massage the kale to coat evenly, then spread the kale across two sheet pans, making sure the leaves don’t overlap. Place the pans on the middle and lower racks of the oven and roast for 25 to 30 minutes, switching racks halfway through, until the kale is crispy. (Watch closely, as it can burn quickly.) Remove from the oven and season well with salt.",
      "Meanwhile, heat a large skillet over medium-high. Add 3 to 4 tablespoons of olive oil to the pan, along with the chickpeas, and fry for 15 to 20 minutes, until golden and crispy. (The chickpeas will pop and some may jump out of the pan; you can reduce the heat a little or use a splatter screen.) Using a slotted spoon, transfer the chickpeas to paper towels to drain briefly. Place the chickpeas in a bowl, sprinkle with the paprika and cayenne, season with salt and pepper and toss to combine.",
      "If you’re including eggs, wipe out the skillet and return it to medium-high heat. When the pan is hot, add a drizzle of olive oil and crack in the eggs, one at a time. Reduce the heat to medium and fry the eggs until the edges are frizzled, the whites are set and the yolks are cooked to your liking. Season with a pinch of salt.",
      "Divide the kale, chickpeas and avocado among four plates and top each with an egg (if using). Serve warm."
    ]
  },
  {
    "name": "Cashew Celery",
    "url": "https://cooking.nytimes.com/recipes/1024394-cashew-celery",
    "image": "https://static01.nyt.com/images/2023/07/14/multimedia/14EVERYDAY-VEGETABLESrex2-fpml/14EVERYDAY-VEGETABLESrex2-fpml-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "2 teaspoons cornstarch",
      "¼ cup vegetable stock or water",
      "2½ tablespoons Shaoxing rice wine",
      "4 teaspoons soy sauce or tamari",
      "Neutral oil",
      "4 to 6 celery stalks (about 8 ounces), trimmed and sliced diagonally",
      "1 (1-inch) piece fresh ginger, peeled and finely chopped",
      "2 garlic cloves, finely chopped",
      "3 scallions, trimmed and sliced",
      "6 ounces dark, leafy greens (such as gai lan, choy sum, kale or spinach), halved lengthwise if they’ve got thick stems, then cut into 2-inch lengths",
      "5 ounces five-spice-flavored or plain extra-firm tofu, cut into ½-inch-thick strips",
      "1 cup roasted, unsalted cashews",
      "Kosher salt",
      "Toasted white sesame seeds, to serve",
      "Cooked white or brown rice, to serve"
    ],
    "full_instructions": [
      "Combine the cornstarch, stock, rice wine and soy sauce in a bowl and whisk until smooth; set aside.",
      "Heat a wok or large skillet over medium-high. Once it’s hot, add 1 to 2 tablespoons of oil, along with the celery. Cook, tossing, for 2 to 3 minutes, until the celery is slightly softened; push it to the side. Add the ginger, garlic and three-quarters of the scallions, then toss for 30 seconds until fragrant. Add the greens and toss for 1 to 2 minutes until slightly wilted. Toss in the tofu and cashews and stir fry for another 1 to 2 minutes, until the tofu is warmed through.",
      "Stir the cornstarch mixture, then swirl it into the wok or skillet and toss until the sauce thickens and coats everything. Taste and season with a little salt, if needed.",
      "Top with the remaining scallions and the sesame seeds; serve with rice."
    ]
  },
  {
    "name": "Soy-Butter Corn Ramen",
    "url": "https://cooking.nytimes.com/recipes/1024398-soy-butter-corn-ramen",
    "image": "https://static01.nyt.com/images/2023/07/14/multimedia/14EVERYDAY-VEGETABLESrex3-hbck/14EVERYDAY-VEGETABLESrex3-hbck-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "4 ears corn, husked",
      "4 scallions, trimmed, white and green parts thinly sliced and separated",
      "4 blocks/12 ounces instant dried ramen noodles, flavor packets discarded",
      "¼ cup soy sauce",
      "¼ cup vegan or regular unsalted butter"
    ],
    "full_instructions": [
      "Snap each corn cob in half to make them easier to handle. Slice the corn kernels off the cobs, and add the cobs to a large pot, along with the white parts of the scallions. Add 5 cups of water to the pot and bring to a boil over medium-high heat. Cover, reduce heat to medium-low and simmer for 8 to 10 minutes, until the smell of corn permeates the kitchen.",
      "Uncover and discard the cobs. Add the noodle blocks to the water and, using chopsticks or tongs, turn the noodles until they loosen up and then cook until most of the water has been absorbed, 2 to 2½ minutes.",
      "Reduce heat to medium-low, add the corn kernels, soy sauce and butter and toss for 1 to 2 minutes, until the noodles are tender, and the corn is barely cooked and still sweet.",
      "Divide among bowls, top with the scallion greens and serve immediately."
    ]
  },
  {
    "name": "Grilled Steak With Sauce Rof",
    "url": "https://cooking.nytimes.com/recipes/1024373-grilled-steak-with-sauce-rof",
    "image": "https://static01.nyt.com/images/2023/07/14/multimedia/yk-steak-with-rof-fwgc/yk-steak-with-rof-fwgc-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "1½ pounds skirt steak or boneless short ribs (see Tip)",
      "Coarse kosher salt (such as Morton) and black pepper",
      "1 medium white or yellow onion, diced",
      "1 serrano chile or jalapeno, stemmed",
      "2 garlic cloves, peeled",
      "4 scallions, trimmed and thinly sliced",
      "1 small bunch parsley, leaves and tender stems only (about 2 ounces)",
      "1 lemon",
      "¼ cup extra-virgin olive oil"
    ],
    "full_instructions": [
      "Pat the steak dry and season lightly with salt.",
      "Roughly chop the onion in a food processor by pulsing repeatedly. Add the serrano and garlic and pulse to combine. Add the scallions and parsley and pulse until chopped into a coarse paste. Transfer the paste to a large bowl and zest the lemon directly into it. Stir in 2 tablespoons oil, 1 teaspoon salt and ½ teaspoon pepper. (Alternatively, finely chop the onion, serrano, garlic, scallions and parsley into a coarse paste by hand. Transfer to a large bowl and stir in the lemon zest, oil, salt and pepper.)",
      "Transfer about ¾ cup of the paste to a small bowl. Place the meat in the large bowl and turn to coat. Marinate for at least 15 minutes at room temperature, or refrigerate, covered if needed, for up to 12 hours.",
      "Combine the reserved marinade with the remaining 2 tablespoons olive oil and squeeze in about 2 tablespoons fresh lemon juice. Season with ¼ teaspoon salt and a pinch of black pepper, stir to combine and set aside.",
      "Heat a charcoal or gas grill to medium-high.",
      "Scrape any excess marinade off the steak and discard. Grill the steak until the contact side is seared, 4 to 5 minutes. Flip and cook for an additional 3 minutes for medium-rare. Cook for an additional minute on each side for medium.",
      "Transfer the steak to a board to rest for at least 5 minutes. Slice and transfer to a serving platter. Spoon the marinade dressing over the steak and serve immediately."
    ]
  },
  {
    "name": "Oven BBQ Chicken",
    "url": "https://cooking.nytimes.com/recipes/1024374-oven-bbq-chicken",
    "image": "https://static01.nyt.com/images/2023/07/14/multimedia/as-oven-bbq-chicken-zpjc/as-oven-bbq-chicken-zpjc-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "1 (18-ounce) jar barbecue sauce, or 2 cups homemade barbecue sauce",
      "About 3 pounds bone-in, skin-on chicken leg quarters or thighs, patted dry",
      "1 tablespoon neutral oil (such as grapeseed)",
      "2 teaspoons store-bought or homemade chili powder",
      "1 teaspoon smoked paprika",
      "Kosher salt (such as Diamond Crystal)",
      "1 teaspoon apple cider vinegar"
    ],
    "full_instructions": [
      "Heat the oven to 425 degrees. Pour the barbecue sauce into a 9-by-13-inch baking pan or dish, or a large skillet, or another ovenproof vessel that fits the chicken snugly, then shake so the sauce disperses into an even layer.",
      "In a large bowl, toss the chicken with the oil, chili powder, paprika and 1 teaspoon salt until coated. Arrange the chicken, skin side up, on top of the barbecue sauce. Roast until the chicken skin is crisp, 30 to 35 minutes.",
      "Scrape the sides of the pan and stir the barbecue sauce to incorporate the caramelized bits into the sauce. Turn the chicken to coat in the sauce, arrange skin-side-up, then spoon sauce on top of the chicken. Roast until the chicken is sticky and charred in spots, 10 to 15 minutes more.",
      "Transfer chicken to plates. Stir the apple cider vinegar into the sauce remaining in the pan. Serve the chicken with the extra sauce."
    ]
  },
  {
    "name": "Basil-Butter Pasta",
    "url": "https://cooking.nytimes.com/recipes/1024372-basil-butter-pasta",
    "image": "https://static01.nyt.com/images/2023/07/13/multimedia/as-basil-butter-pasta-zvgw/as-basil-butter-pasta-zvgw-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "Salt",
      "3 cups packed basil leaves (about 80 grams, from 2 large bunches)",
      "6 tablespoons unsalted butter, sliced, at room temperature",
      "1 pound of any pasta, any type"
    ],
    "full_instructions": [
      "Bring a large pot of well-salted water to a boil. Place the basil in a heatproof colander. Once the water is boiling, submerge the colander with the basil into the pot and use a spoon to push the leaves into the water. Blanch for 10 seconds, then immediately rinse the leaves under cold water to stop the cooking. Squeeze them dry with your hands. Reserve the boiling water.",
      "Transfer the basil to a food processor and pulse until finely chopped. Add the butter and process, scraping the sides of the food processor as needed, until very smooth. Refrigerate until ready to use. (Basil butter will keep, refrigerated, for up to 1 week, or in the freezer for several months.)",
      "Add the pasta to the boiling water and cook until tender. Reserve 1 cup of the pasta cooking water, then drain the pasta. Return the pasta and ¼ cup of the reserved pasta water to the pot, then add the basil butter and toss to coat. (Doesn’t it smell incredible?) If the pasta is dry instead of silky and glossy, add more pasta water, 1 tablespoon at a time. Season to taste with salt."
    ]
  },
  {
    "name": "Paneer Chile Dry",
    "url": "https://cooking.nytimes.com/recipes/1024371-paneer-chile-dry",
    "image": "https://static01.nyt.com/images/2023/07/12/multimedia/zs-paneer-chili-dry-pmzv/zs-paneer-chili-dry-pmzv-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "3 tablespoons all-purpose flour",
      "2 tablespoons plus 1 teaspoon cornstarch",
      "½ teaspoon freshly ground black pepper, plus more for serving",
      "¼ teaspoon Kashmiri red chile powder (or other mild red chile powder)",
      "1 pound paneer (store-bought or homemade), cut into ¾-inch cubes (see Tip)",
      "2 tablespoons soy sauce (preferably dark soy sauce)",
      "2 tablespoons ketchup",
      "1 tablespoon rice vinegar",
      "¼ cup vegetable or other neutral oil",
      "3 whole dried red chiles (such as dundicut or Thai), stems removed",
      "3 fresh green Thai or serrano chiles, sliced",
      "1 tablespoon garlic paste or freshly grated garlic",
      "1 teaspoon ginger paste or freshly grated ginger",
      "1 bell pepper, halved, seeded and cut into ¾-inch pieces",
      "1 medium onion, halved and cut into ¾-inch pieces",
      "2 scallions, sliced",
      "Rice (optional), for serving"
    ],
    "full_instructions": [
      "In a large bowl, mix flour, 2 tablespoons cornstarch, ½ teaspoon black pepper and the Kashmiri red chile powder with ¼ cup water to form a smooth, thick paste. Add paneer and, using your hands or a spatula, coat evenly.",
      "In a small bowl, mix soy sauce, ketchup, rice vinegar and remaining 1 teaspoon cornstarch; set aside.",
      "In a large frying pan or wok, heat the oil for 45 seconds on high. Add paneer pieces and fry undisturbed until paneer starts to change color, 10 to 30 seconds. Flip to fry the opposite side until paneer starts to turn golden, 10 to 30 seconds more. Remove paneer pieces and set aside.",
      "To the same pan, stir in dried red chiles, fresh green chiles, garlic and ginger; cook for 30 seconds. Stir in bell pepper and onion and continue cooking, stirring occasionally, until onion and bell pepper soften, 3 to 5 minutes.",
      "Return the paneer to the pan and stir until everything is thoroughly mixed. Stir the soy sauce mixture then pour it into the pan. Cook, stirring, until the sauce evenly coats the paneer, onion and bell pepper, about 3 minutes. Top with additional black pepper and the scallions. Serve with rice or on its own."
    ]
  },
  {
    "name": "Fruit Salad",
    "url": "https://cooking.nytimes.com/recipes/1024369-fruit-salad",
    "image": "https://static01.nyt.com/images/2023/07/11/multimedia/as-fruit-salad-bjcv/as-fruit-salad-bjcv-articleLarge-v2.jpg?w=1280&q=75",
    "ingredients": [
      "1 lime",
      "2 tablespoons granulated sugar",
      "7 to 8 cups bite-size pieces of mixed, ripe fruit (such as any combination of watermelon, pineapple, berries, kiwi, stone fruit, mango, pomegranate and grapes)"
    ],
    "full_instructions": [
      "Zest half the lime into a small bowl (about 1 teaspoon zest). Add the sugar and pinch until the mixture is fragrant and resembles wet sand.",
      "Add the fruit to a large bowl. Add most of the sugar (hold back ½ tablespoon or so) and squeeze in 1 teaspoon lime juice. Stir gently to combine, then let sit for 5 minutes. Stir once more to coat the fruit with the juices collected in the bottom of the bowl. Taste, and if the mixture is too sweet, add more lime juice, 1 teaspoon at a time. If you want it sweeter, add the remaining lime sugar.",
      "Eat right away or let sit for up to 1 hour at room temperature. The salad can also be refrigerated for up to 1 day, though some fruits may get mushy."
    ]
  },
  {
    "name": "Zucchini Pasta With Crispy Capers and Pistachios",
    "url": "https://cooking.nytimes.com/recipes/1024237-zucchini-pasta-with-crispy-capers-and-pistachios",
    "image": "https://static01.nyt.com/images/2023/07/16/multimedia/16EAT-zucchini-pasta-bjgv/16EAT-zucchini-pasta-bjgv-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "⅔ cup olive oil",
      "4 medium zucchini (about 1¾ pounds), 2 sliced into ⅛-inch-thick rounds, remaining 2 zucchini quartered lengthwise then chopped into 1½-inch pieces",
      "Fine sea salt",
      "4 teaspoons red wine vinegar",
      "3 tablespoons drained capers, patted dry",
      "⅓ packed cup basil leaves",
      "¼ cup shelled pistachios",
      "6 garlic cloves, roughly chopped",
      "10 ounces tubetti or ditalini pasta"
    ],
    "full_instructions": [
      "Heat the oil in a small saucepan over medium-high. Once hot, fry ⅓ of the sliced zucchini for 5 to 7 minutes until golden brown. Remove with a slotted spoon, transfer to a paper towel-lined plate and season with a pinch of salt. Cook the remaining sliced zucchini the same way in two more batches, then transfer to a small bowl. Mix in the vinegar, then set aside to marinate.",
      "Reduce the heat to medium. Carefully add the capers to the oil and let fry for 2 to 3 minutes until crisp and dark green, then use a slotted spoon to transfer them onto a paper towel-lined plate. Repeat with the basil leaves, cooking until they darken and crisp up, about 1 minute. Finally, fry the pistachios for 1 minute, until slightly golden, and transfer to the lined plate. Once cool enough to handle, roughly chop the pistachios and set aside for later.",
      "Pour the hot oil into a medium saucepan; add the remaining raw zucchini and ¾ teaspoon salt. Cook over high heat for 5 minutes, stirring occasionally, until lightly browned, then mix in the garlic and pasta. Cook for 1 minute, then stir in 2½ cups hot water. Bring back to a boil and cook, stirring often, until the water has reduced and the pasta is al dente, 8 to 10 minutes. (If the water evaporates before the pasta is cooked, add ¼ cup water as needed.)",
      "Stir in half the pistachios and half the fried zucchini, then transfer the pasta to a large platter or shallow bowl. Scatter the remaining pistachios and zucchini on top, plus the basil and capers. Serve hot, at room temperature or even chilled."
    ]
  },
  {
    "name": "Zucchini Tofu Udon",
    "url": "https://cooking.nytimes.com/recipes/1024370-zucchini-tofu-udon",
    "image": "https://static01.nyt.com/images/2023/07/11/multimedia/hm-udon-with-zucchini-vhgq/hm-udon-with-zucchini-vhgq-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "1½ pounds (4 blocks) fresh, vacuum-sealed udon noodles",
      "4 tablespoons unsalted butter, melted",
      "4 tablespoons white fuyu (fermented tofu), plus optional 1 tablespoon of the brine (see Tip) (or white miso)",
      "2 tablespoons soy sauce",
      "Extra virgin olive oil",
      "1 (14-ounce) package extra-firm tofu, drained and crumbled",
      "1 teaspoon kosher salt (such as Diamond Crystal), plus more to taste",
      "2 medium zucchini (12 ounces), trimmed and cut into ¼ inch batons",
      "2 garlic cloves, finely chopped",
      "1 teaspoon freshly ground black pepper",
      "2 scallions, trimmed and finely sliced"
    ],
    "full_instructions": [
      "Bring a large pot of salted water to a boil, add the udon noodles and cook for about 2 minutes, using wooden chopsticks or tongs to gently loosen the noodles from their tight bundle. Drain, rinse with cold water and leave to continue draining while you prepare the remaining ingredients.",
      "Meanwhile, place the melted butter, fuyu and soy sauce in a bowl and whisk together until smooth. If the mixture looks too thick, add 1 tablespoon of the fuyu brine or water to loosen up the mixture. Set aside.",
      "Heat a large 12-inch skillet or wok on medium high. When hot, add 1 to 2 tablespoons of olive oil, along with the tofu and salt and toss for 2 to 3 minutes until the tofu has released some of its liquid. Add the zucchini and garlic and toss for 2 minutes until it has softened.",
      "Add the udon, the butter-fuyu mixture and black pepper and toss well to combine. Stir-fry for 2 minutes, until the noodles are heated through.",
      "To serve, top with scallions."
    ]
  },
  {
    "name": "Frijoles de Olla (Homestyle Black Beans)",
    "url": "https://cooking.nytimes.com/recipes/1024131-frijoles-de-olla-homestyle-black-beans",
    "image": "https://static01.nyt.com/images/2023/07/07/multimedia/07TORTILLASREX4-frijoles-de-olla-cmqb/TORTILLASREX4-frijoles-de-olla-cmqb-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "1 pound/453 grams dried black beans, rinsed and picked through",
      "¼ medium white onion, chopped",
      "3 garlic cloves, finely chopped",
      "2 dried or fresh avocado or bay leaves",
      "3 fresh epazote sprigs or a combination of parsley, oregano and mint sprigs",
      "Fine sea salt"
    ],
    "full_instructions": [
      "In a large pot, combine the beans, onion, garlic, avocado leaves, epazote, 4 teaspoons salt and 16 cups of water. Bring to a boil over high. Reduce the heat to medium-low and cook at a slow simmer, uncovered, skimming and stirring occasionally, until the beans are tender, 1½ to 3½ hours. Check the beans every hour to see if they need more water; the beans should always be covered by water. The cooking time will depend on how old the beans are; freshly dried beans can fully cook in 1½ hours.",
      "Remove and discard the herbs. Taste and season the beans with more salt if desired. The beans and their cooking liquid can be refrigerated for up to 2 days. Or, make them up to 3 months ahead and freeze in an airtight container."
    ]
  },
  {
    "name": "Tetelas de Frijol Negro (Black Bean Masa Dumplings)",
    "url": "https://cooking.nytimes.com/recipes/1024130-tetelas-de-frijol-negro-black-bean-masa-dumplings",
    "image": "https://static01.nyt.com/images/2023/07/07/multimedia/07TORTILLASREX3-tetelas-mbfg/TORTILLASREX3-tetelas-mbfg-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "1 pound/453 grams fresh fine-grind corn masa for tortillas (about 1¾ cups) or 2 cups/260 grams masa harina (see Tips)",
      "Fine sea salt",
      "3 tablespoons rendered lard (preferably not hydrogenated)",
      "¼ medium white onion, sliced",
      "1 garlic clove, sliced",
      "1 to 2 chiles de árbol, stemmed (1 for mild or 2 for spicy) or ¼ to ½ teaspoon red-pepper flakes",
      "2 fresh or dried avocado leaves, woody stem removed, or 1 sprig parsley and 1 sprig tarragon",
      "1 (15-ounce) can black beans and their liquid (or 2 cups homemade Frijoles de Olla and ⅓ cup of their liquid)",
      "Crema, crumbled queso fresco and salsa, for serving"
    ],
    "full_instructions": [
      "Set out a blender; a 1-gallon zip-top freezer bag; a plastic produce bag or plastic wrap; and a tortilla press, smooth-bottomed 10-inch skillet or a glass pie plate.",
      "If using fresh masa, knead the fresh masa, ¼ teaspoon salt and 2 tablespoons water with your hands in a large bowl until the mixture is soft and pliable but doesn't stick to your hands. If using masa harina, mix the masa harina, ¼ teaspoon salt and 1⅓ cups water with your hands in a large bowl until the mixture is soft and pliable but doesn’t stick to your hands.",
      "Scoop ¼ cup of masa, roll into a ball and pat into a ½-inch thick patty. If the edges are cracked and craggy, the masa needs more water. The edges of the patty should be completely smooth; this is the sign that the masa is properly hydrated. If it's still too dry or crumbly, add a tablespoon or two more water, one at a time, and mix to incorporate. When fully hydrated, knead for 3 minutes, cover the bowl with a damp clean towel and let sit for 20 minutes.",
      "To make the filling, heat 2 tablespoons of lard in a heavy medium skillet, preferably cast iron, over medium-high and cook the onion, garlic, chiles and avocado leaves, stirring occasionally, until tender and brown, 6 to 8 minutes.",
      "Use a slotted spoon to transfer the onion mixture to a blender, leaving as much lard in the skillet as possible. Add the beans and their liquid and purée until smooth.",
      "To the skillet with the reserved lard, add the remaining 1 tablespoon lard and heat over high until just beginning to smoke, about 1 minute. Carefully and quickly add the bean purée to the hot oil; the mixture will spit and sputter but then rapidly settle down. Cook, stirring frequently to avoid scorching, until the mixture is very thick and is the consistency of pudding, 5 to 8 minutes. Remove from the heat, taste and season with salt if necessary. Let cool; the beans will thicken as they sit.",
      "Cut an 8-inch square of plastic from a zip top bag and from a produce bag. (The masa will be easier to remove from the plastic if you use two pieces of differing thicknesses.) Divide the dough into 9 ping-pong ball-sized portions and roll into balls. Arrange on a sheet pan and keep covered with a damp kitchen towel while you press and cook the tetelas.",
      "Heat a comal, medium nonstick skillet, well-seasoned cast-iron skillet or griddle over medium-heat. Place the thicker plastic square on the bottom of the press. Working with one dough ball at a time, open the press and place one ball in the center and top with the thinner plastic. Gently press, holding steady firm pressure for a few seconds to flatten the dough to a 6½-inch round. Open the press and remove the top plastic. (Alternatively, you can place the thicker plastic on a clean work surface and top with a masa ball and the thinner plastic and press down with a smooth-bottomed large skillet or pie plate.)",
      "To make each tetela, place 1 tablespoon bean paste in the center of a masa round and gently spread into a 3-inch circle. Using the plastic to help you, fold over one side of the masa round towards the center and gently press into the bean paste. Peel the plastic back from the folded section. Fold a second section over at a 45-degree angle. Press into the bean paste in the center of the masa round and peel the plastic back. You should have a triangle-shaped top and a rounded bottom. Fold the bottom into the center making a triangle with no beans showing. Peel the plastic back and pat the masa at the seams to seal.",
      "Cook the tetelas, two at a time, until deep brown in spots on both sides and slightly puffed, about 2 minutes per side. Place on a plate and cover with a clean kitchen towel to keep them warm. Repeat with the remaining dough balls and bean paste. Serve warm with a drizzle of crema, a sprinkle of queso fresco and salsa on the side."
    ]
  },
  {
    "name": "Paprika-Rubbed Pork Chops",
    "url": "https://cooking.nytimes.com/recipes/1024335-paprika-rubbed-pork-chops",
    "image": "https://static01.nyt.com/images/2023/07/06/multimedia/06tanisrex2-pork-tqvk/05tanisrex2-pork-tqvk-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "1 tablespoon kosher salt",
      "1 tablespoon pimentón de la Vera or smoked paprika, plus more for dusting",
      "2 teaspoons granulated sugar",
      "⅓ teaspoon ground coriander",
      "A small pinch of ground cayenne",
      "6 boneless pork chops, cut ¾-inch thick (about 2 pounds)",
      "Olive oil, for drizzling and searing",
      "Lime wedges, for serving"
    ],
    "full_instructions": [
      "Make the marinade: In a small bowl, stir together kosher salt, pimentón, sugar, coriander and cayenne.",
      "Prepare the chops: Carefully sprinkle ½ teaspoon marinade over the surface of each chop. Repeat on the other side of the chops. Drizzle a little olive oil over each chop, and rub into the meat on both sides. Refrigerate for at least 1 hour or up to 2 days.",
      "Just before cooking, bring chops to room temperature. In an oil-filmed cast-iron pan over medium-high heat, and working in batches to avoid crowding the pan, cook just until chops are lightly browned and firm to the touch, for about 2 minutes per side. Transfer to a serving platter and dust with more pimentón. Serve with lime wedges."
    ]
  },
  {
    "name": "Bloody Mary Tomato Salad",
    "url": "https://cooking.nytimes.com/recipes/1024365-bloody-mary-tomato-salad",
    "image": "https://static01.nyt.com/images/2023/07/06/multimedia/hm-bloody-mary-salad-tgfk/hm-bloody-mary-salad-tgfk-articleLarge.jpg?w=1280&q=75",
    "ingredients": [
      "2 celery stalks, thinly sliced",
      "1 small red onion or shallot, thinly sliced",
      "1 tablespoon lemon juice (from ½ small lemon)",
      "¼ teaspoon granulated sugar",
      "Kosher salt (such as Diamond Crystal)",
      "2 pounds ripe tomatoes (any variety), cut into roughly 1 to 2-inch pieces",
      "½ teaspoon black pepper",
      "Handful of chopped parsley",
      "1 tablespoon soy sauce",
      "1 tablespoon balsamic vinegar",
      "1½ to 2 teaspoons hot sauce, preferably Tabasco",
      "1 clove garlic, grated",
      "½ teaspoon celery salt",
      "2 tablespoons extra virgin olive oil"
    ],
    "full_instructions": [
      "Place celery and red onion in a bowl, and add lemon juice, sugar and ¼ teaspoon of salt. Toss and leave to soften for 5 to 10 minutes while you prepare the rest of the salad.",
      "To make the dressing, combine the soy sauce, balsamic vinegar, hot sauce, garlic, celery salt and olive oil in a bowl and stir to combine.",
      "Tip the celery and red onions into a colander and allow to drain. Squeeze out any excess liquid.",
      "Place the tomatoes in a large bowl and add the celery and onion. Add the dressing, along with the black pepper; stir gently to combine. Taste and season with more salt, if needed. To serve, top with parsley."
    ]
  }
]